{
    "Old": {
        "Genesis": [
            {
                "reference": "Genesis 1:1-2",
                "ESV": "In the beginning, God created the heavens and the earth. The earth was without form and void, and darkness was over the face of the deep. And the Spirit of God was hovering over the face of the waters.",
                "KJV": "In the beginning God created the heaven and the earth.<br><br>And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters.",
                "NASB": "In the beginning God created the heavens and the earth. And the earth was a formless and desolate emptiness, and darkness was over the surface of the deep, and the Spirit of God was hovering over the surface of the waters.",
                "NIV": "In the beginning God created the heavens and the earth. Now the earth was formless and empty, darkness was over the surface of the deep, and the Spirit of God was hovering over the waters.",
                "NKJV": "In the beginning God created the heavens and the earth. The earth was without form, and void; and darkness was on the face of the deep. And the Spirit of God was hovering over the face of the waters."
            },
            {
                "reference": "Genesis 1:27",
                "ESV": "So God created man in his own image,<br>    in the image of God he created him;<br>    male and female he created them.",
                "KJV": "So God created man in his own image, in the image of God created he him; male and female created he them.",
                "NASB": "So God created man in His own image, in the image of God He created him; male and female He created them.",
                "NIV": "So God created mankind in his own image,<br>    in the image of God he created them;<br>    male and female he created them.",
                "NKJV": "So God created man in His own image; in the image of God He created him; male and female He created them."
            },
            {
                "reference": "Genesis 2:24",
                "ESV": "Therefore a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh.",
                "KJV": "Therefore shall a man leave his father and his mother, and shall cleave unto his wife: and they shall be one flesh.",
                "NASB": "For this reason a man shall leave his father and his mother, and be joined to his wife; and they shall become one flesh.",
                "NIV": "That is why a man leaves his father and mother and is united to his wife, and they become one flesh.",
                "NKJV": "Therefore a man shall leave his father and mother and be joined to his wife, and they shall become one flesh."
            },
            {
                "reference": "Genesis 15:6",
                "ESV": "And he believed the Lord, and he counted it to him as righteousness.",
                "KJV": "And he believed in the Lord; and he counted it to him for righteousness.",
                "NASB": "Then he believed in the Lord; and He credited it to him as righteousness.",
                "NIV": "Abram believed the Lord, and he credited it to him as righteousness.",
                "NKJV": "And he believed in the Lord, and He accounted it to him for righteousness."
            },
            {
                "reference": "Genesis 50:20",
                "ESV": "As for you, you meant evil against me, but God meant it for good, to bring it about that many people should be kept alive, as they are today.",
                "KJV": "But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive.",
                "NASB": "As for you, you meant evil against me, but God meant it for good in order to bring about this present result, to keep many people alive.",
                "NIV": "You intended to harm me, but God intended it for good to accomplish what is now being done, the saving of many lives.",
                "NKJV": "But as for you, you meant evil against me; but God meant it for good, in order to bring it about as it is this day, to save many people alive."
            }
        ],
        "Exodus": [
            {
                "reference": "Exodus 3:14",
                "ESV": "God said to Moses, “I am who I am.” And he said, “Say this to the people of Israel: ‘I am has sent me to you.’”",
                "KJV": "And God said unto Moses, I Am That I Am: and he said, Thus shalt thou say unto the children of Israel, I Am hath sent me unto you.",
                "NASB": "And God said to Moses, “I AM WHO I AM”; and He said, “This is what you shall say to the sons of Israel: ‘I AM has sent me to you.’”",
                "NIV": "God said to Moses, “I am who I am. This is what you are to say to the Israelites: ‘I am has sent me to you.’”",
                "NKJV": "And God said to Moses, “I AM WHO I AM.” And He said, “Thus you shall say to the children of Israel, ‘I AM has sent me to you.’ ”"
            }
        ],
        "Leviticus": [
            {
                "reference": "Leviticus 19:18",
                "ESV": "You shall not take vengeance or bear a grudge against the sons of your own people, but you shall love your neighbor as yourself: I am the Lord.",
                "KJV": "Thou shalt not avenge, nor bear any grudge against the children of thy people, but thou shalt love thy neighbour as thyself: I am the Lord.",
                "NASB": "You shall not take vengeance, nor hold any grudge against the sons of your people, but you shall love your neighbor as yourself; I am the Lord.",
                "NIV": "“‘Do not seek revenge or bear a grudge against anyone among your people, but love your neighbor as yourself. I am the Lord.",
                "NKJV": "You shall not take vengeance, nor bear any grudge against the children of your people, but you shall love your neighbor as yourself: I am the Lord."
            }
        ],
        "Numbers": [
            {
                "reference": "Numbers 6:24-26",
                "ESV": "The Lord bless you and keep you;<br>the Lord make his face to shine upon you and be gracious to you;<br>the Lord lift up his countenance upon you and give you peace.",
                "KJV": "The Lord bless thee, and keep thee:<br><br>The Lord make his face shine upon thee, and be gracious unto thee:<br><br>The Lord lift up his countenance upon thee, and give thee peace.",
                "NASB": "The Lord bless you, and keep you;<br><br>The Lord cause His face to shine on you,<br>And be gracious to you;<br><br>The Lord lift up His face to you,<br>And give you peace.’",
                "NIV": "“‘“The Lord bless you<br>    and keep you;<br>the Lord make his face shine on you<br>    and be gracious to you;<br>the Lord turn his face toward you<br>    and give you peace.”’",
                "NKJV": "“The Lord bless you and keep you;<br>The Lord make His face shine upon you,<br>And be gracious to you;<br>The Lord lift up His countenance upon you,<br>And give you peace.” ’"
            }
        ],
        "Deuteronomy": [
            {
                "reference": "Deuteronomy 6:4-5",
                "ESV": "“Hear, O Israel: The Lord our God, the Lord is one. You shall love the Lord your God with all your heart and with all your soul and with all your might.",
                "KJV": "Hear, O Israel: The Lord our God is one Lord:<br><br>And thou shalt love the Lord thy God with all thine heart, and with all thy soul, and with all thy might.",
                "NASB": "“Hear, Israel! The Lord is our God, the Lord is one! And you shall love the Lord your God with all your heart and with all your soul and with all your strength.",
                "NIV": "Hear, O Israel: The Lord our God, the Lord is one. Love the Lord your God with all your heart and with all your soul and with all your strength.",
                "NKJV": "“Hear, O Israel: The Lord our God, the Lord is one! You shall love the Lord your God with all your heart, with all your soul, and with all your strength."
            },
            {
                "reference": "Deuteronomy 10:12-13",
                "ESV": "“And now, Israel, what does the Lord your God require of you, but to fear the Lord your God, to walk in all his ways, to love him, to serve the Lord your God with all your heart and with all your soul, and to keep the commandments and statutes of the Lord, which I am commanding you today for your good?",
                "KJV": "And now, Israel, what doth the Lord thy God require of thee, but to fear the Lord thy God, to walk in all his ways, and to love him, and to serve the Lord thy God with all thy heart and with all thy soul,<br><br>To keep the commandments of the Lord, and his statutes, which I command thee this day for thy good?",
                "NASB": "“And now, Israel, what does the Lord your God require of you, but to fear the Lord your God, to walk in all His ways and love Him, and to serve the Lord your God with all your heart and with all your soul, and to keep the Lord’s commandments and His statutes which I am commanding you today for your good?",
                "NIV": "And now, Israel, what does the Lord your God ask of you but to fear the Lord your God, to walk in obedience to him, to love him, to serve the Lord your God with all your heart and with all your soul, and to observe the Lord’s commands and decrees that I am giving you today for your own good?",
                "NKJV": "“And now, Israel, what does the Lord your God require of you, but to fear the Lord your God, to walk in all His ways and to love Him, to serve the Lord your God with all your heart and with all your soul, and to keep the commandments of the Lord and His statutes which I command you today for your good?"
            }
        ],
        "Joshua": [
            {
                "reference": "Joshua 1:8-9",
                "ESV": "This Book of the Law shall not depart from your mouth, but you shall meditate on it day and night, so that you may be careful to do according to all that is written in it. For then you will make your way prosperous, and then you will have good success. Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.”",
                "KJV": "This book of the law shall not depart out of thy mouth; but thou shalt meditate therein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success.<br><br>Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the Lord thy God is with thee whithersoever thou goest.",
                "NASB": "This Book of the Law shall not depart from your mouth, but you shall meditate on it day and night, so that you may be careful to do according to all that is written in it; for then you will make your way prosperous, and then you will achieve success. Have I not commanded you? Be strong and courageous! Do not be terrified nor dismayed, for the Lord your God is with you wherever you go.”",
                "NIV": "Keep this Book of the Law always on your lips; meditate on it day and night, so that you may be careful to do everything written in it. Then you will be prosperous and successful. Have I not commanded you? Be strong and courageous. Do not be afraid; do not be discouraged, for the Lord your God will be with you wherever you go.”",
                "NKJV": "This Book of the Law shall not depart from your mouth, but you shall meditate in it day and night, that you may observe to do according to all that is written in it. For then you will make your way prosperous, and then you will have good success. Have I not commanded you? Be strong and of good courage; do not be afraid, nor be dismayed, for the Lord your God is with you wherever you go.”"
            }
        ],
        "1 Samuel": [
            {
                "reference": "1 Samuel 16:7",
                "ESV": "But the Lord said to Samuel, “Do not look on his appearance or on the height of his stature, because I have rejected him. For the Lord sees not as man sees: man looks on the outward appearance, but the Lord looks on the heart.”",
                "KJV": "But the Lord said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the Lord seeth not as man seeth; for man looketh on the outward appearance, but the Lord looketh on the heart.",
                "NASB": "But the Lord said to Samuel, “Do not look at his appearance or at the height of his stature, because I have rejected him; for God does not see as man sees, since man looks at the outward appearance, but the Lord looks at the heart.”",
                "NIV": "But the Lord said to Samuel, “Do not consider his appearance or his height, for I have rejected him. The Lord does not look at the things people look at. People look at the outward appearance, but the Lord looks at the heart.”",
                "NKJV": "But the Lord said to Samuel, “Do not look at his appearance or at his physical stature, because I have refused him. For the Lord does not see as man sees; for man looks at the outward appearance, but the Lord looks at the heart.”"
            }
        ],
        "1 Chronicles": [
            {
                "reference": "1 Chronicles 29:10-13",
                "ESV": "Therefore David blessed the Lord in the presence of all the assembly. And David said: “Blessed are you, O Lord, the God of Israel our father, forever and ever. Yours, O Lord, is the greatness and the power and the glory and the victory and the majesty, for all that is in the heavens and in the earth is yours. Yours is the kingdom, O Lord, and you are exalted as head above all. Both riches and honor come from you, and you rule over all. In your hand are power and might, and in your hand it is to make great and to give strength to all. And now we thank you, our God, and praise your glorious name.",
                "KJV": "Wherefore David blessed the Lord before all the congregation: and David said, Blessed be thou, Lord God of Israel our father, for ever and ever.<br><br>Thine, O Lord is the greatness, and the power, and the glory, and the victory, and the majesty: for all that is in the heaven and in the earth is thine; thine is the kingdom, O Lord, and thou art exalted as head above all.<br><br>Both riches and honour come of thee, and thou reignest over all; and in thine hand is power and might; and in thine hand it is to make great, and to give strength unto all.<br><br>Now therefore, our God, we thank thee, and praise thy glorious name.",
                "NASB": "So David blessed the Lord in the sight of all the assembly; and David said, “Blessed are You, Lord God of Israel our father, forever and ever. Yours, Lord, is the greatness, the power, the glory, the victory, and the majesty, indeed everything that is in the heavens and on the earth; Yours is the dominion, Lord, and You exalt Yourself as head over all. Both riches and honor come from You, and You rule over all, and in Your hand is power and might; and it lies in Your hand to make great and to strengthen everyone. Now therefore, our God, we thank You, and praise Your glorious name.",
                "NIV": "David praised the Lord in the presence of the whole assembly, saying,<br><br>“Praise be to you, Lord,<br>    the God of our father Israel,<br>    from everlasting to everlasting.<br>Yours, Lord, is the greatness and the power<br>    and the glory and the majesty and the splendor,<br>    for everything in heaven and earth is yours.<br>Yours, Lord, is the kingdom;<br>    you are exalted as head over all.<br>Wealth and honor come from you;<br>    you are the ruler of all things.<br>In your hands are strength and power<br>    to exalt and give strength to all.<br>Now, our God, we give you thanks,<br>    and praise your glorious name.",
                "NKJV": "Therefore David blessed the Lord before all the assembly; and David said:<br><br>“Blessed are You, Lord God of Israel, our Father, forever and ever.<br>Yours, O Lord, is the greatness,<br>The power and the glory,<br>The victory and the majesty;<br>For all that is in heaven and in earth is Yours;<br>Yours is the kingdom, O Lord,<br>And You are exalted as head over all.<br>Both riches and honor come from You,<br>And You reign over all.<br>In Your hand is power and might;<br>In Your hand it is to make great<br>And to give strength to all.<br><br>“Now therefore, our God,<br>We thank You<br>And praise Your glorious name."
            }
        ],
        "Ezra": [
            {
                "reference": "Ezra 7:10",
                "ESV": "For Ezra had set his heart to study the Law of the Lord, and to do it and to teach his statutes and rules in Israel.",
                "KJV": "For Ezra had prepared his heart to seek the law of the Lord, and to do it, and to teach in Israel statutes and judgments.",
                "NASB": "For Ezra had firmly resolved to study the Law of the Lord and to practice it, and to teach His statutes and ordinances in Israel.",
                "NIV": "For Ezra had devoted himself to the study and observance of the Law of the Lord, and to teaching its decrees and laws in Israel.",
                "NKJV": "For Ezra had prepared his heart to seek the Law of the Lord, and to do it, and to teach statutes and ordinances in Israel."
            }
        ],
        "Job": [
            {
                "reference": "Job 1:21",
                "ESV": "And he said, “Naked I came from my mother's womb, and naked shall I return. The Lord gave, and the Lord has taken away; blessed be the name of the Lord.”",
                "KJV": "And said, Naked came I out of my mother's womb, and naked shall I return thither: the Lord gave, and the Lord hath taken away; blessed be the name of the Lord.",
                "NASB": "He said,<br><br>“Naked I came from my mother’s womb,<br>And naked I shall return there.<br>The Lord gave and the Lord has taken away.<br>Blessed be the name of the Lord.”",
                "NIV": "and said:<br><br>“Naked I came from my mother’s womb,<br>    and naked I will depart.<br>The Lord gave and the Lord has taken away;<br>    may the name of the Lord be praised.”",
                "NKJV": "And he said:<br><br>“Naked I came from my mother’s womb,<br>And naked shall I return there.<br>The Lord gave, and the Lord has taken away;<br>Blessed be the name of the Lord.”"
            }
        ],
        "Psalms": [
            {
                "reference": "Psalm 1",
                "ESV": "Blessed is the man<br>    who walks not in the counsel of the wicked,<br>nor stands in the way of sinners,<br>    nor sits in the seat of scoffers;<br>but his delight is in the law of the Lord,<br>    and on his law he meditates day and night.<br><br>He is like a tree<br>    planted by streams of water<br>that yields its fruit in its season,<br>    and its leaf does not wither.<br>In all that he does, he prospers.<br>The wicked are not so,<br>    but are like chaff that the wind drives away.<br><br>Therefore the wicked will not stand in the judgment,<br>    nor sinners in the congregation of the righteous;<br>for the Lord knows the way of the righteous,<br>    but the way of the wicked will perish.",
                "KJV": "Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in the seat of the scornful.<br><br>But his delight is in the law of the Lord; and in his law doth he meditate day and night.<br><br>And he shall be like a tree planted by the rivers of water, that bringeth forth his fruit in his season; his leaf also shall not wither; and whatsoever he doeth shall prosper.<br><br>The ungodly are not so: but are like the chaff which the wind driveth away.<br><br>Therefore the ungodly shall not stand in the judgment, nor sinners in the congregation of the righteous.<br><br>For the Lord knoweth the way of the righteous: but the way of the ungodly shall perish.",
                "NASB": "Blessed is the person who does not walk in the counsel of the wicked,<br>Nor stand in the path of sinners,<br>Nor sit in the seat of scoffers!<br>But his delight is in the Law of the Lord,<br>And on His Law he meditates day and night.<br>He will be like a tree planted by streams of water,<br>Which yields its fruit in its season,<br>And its leaf does not wither;<br>And in whatever he does, he prospers.<br><br>The wicked are not so,<br>But they are like chaff which the wind blows away.<br>Therefore the wicked will not stand in the judgment,<br>Nor sinners in the assembly of the righteous.<br>For the Lord knows the way of the righteous,<br>But the way of the wicked will perish.",
                "NIV": "Blessed is the one<br>    who does not walk in step with the wicked<br>or stand in the way that sinners take<br>    or sit in the company of mockers,<br>but whose delight is in the law of the Lord,<br>    and who meditates on his law day and night.<br>That person is like a tree planted by streams of water,<br>    which yields its fruit in season<br>and whose leaf does not wither—<br>    whatever they do prospers.<br><br>Not so the wicked!<br>    They are like chaff<br>    that the wind blows away.<br>Therefore the wicked will not stand in the judgment,<br>    nor sinners in the assembly of the righteous.<br><br>For the Lord watches over the way of the righteous,<br>    but the way of the wicked leads to destruction.",
                "NKJV": "Blessed is the man<br>Who walks not in the counsel of the ungodly,<br>Nor stands in the path of sinners,<br>Nor sits in the seat of the scornful;<br>But his delight is in the law of the Lord,<br>And in His law he meditates day and night.<br>He shall be like a tree<br>Planted by the rivers of water,<br>That brings forth its fruit in its season,<br>Whose leaf also shall not wither;<br>And whatever he does shall prosper.<br><br>The ungodly are not so,<br>But are like the chaff which the wind drives away.<br>Therefore the ungodly shall not stand in the judgment,<br>Nor sinners in the congregation of the righteous.<br><br>For the Lord knows the way of the righteous,<br>But the way of the ungodly shall perish."
            },
            {
                "reference": "Psalm 8",
                "ESV": "O Lord, our Lord,<br>    how majestic is your name in all the earth!<br>You have set your glory above the heavens.<br>    Out of the mouth of babies and infants,<br>you have established strength because of your foes,<br>    to still the enemy and the avenger.<br><br>When I look at your heavens, the work of your fingers,<br>    the moon and the stars, which you have set in place,<br>what is man that you are mindful of him,<br>    and the son of man that you care for him?<br><br>Yet you have made him a little lower than the heavenly beings<br>    and crowned him with glory and honor.<br>You have given him dominion over the works of your hands;<br>    you have put all things under his feet,<br>all sheep and oxen,<br>    and also the beasts of the field,<br>the birds of the heavens, and the fish of the sea,<br>    whatever passes along the paths of the seas.<br><br>O Lord, our Lord,<br>    how majestic is your name in all the earth!",
                "KJV": "O Lord, our Lord, how excellent is thy name in all the earth! who hast set thy glory above the heavens.<br><br>Out of the mouth of babes and sucklings hast thou ordained strength because of thine enemies, that thou mightest still the enemy and the avenger.<br><br>When I consider thy heavens, the work of thy fingers, the moon and the stars, which thou hast ordained;<br><br>What is man, that thou art mindful of him? and the son of man, that thou visitest him?<br><br>For thou hast made him a little lower than the angels, and hast crowned him with glory and honour.<br><br>Thou madest him to have dominion over the works of thy hands; thou hast put all things under his feet:<br><br>All sheep and oxen, yea, and the beasts of the field;<br><br>The fowl of the air, and the fish of the sea, and whatsoever passeth through the paths of the seas.<br><br>O Lord our Lord, how excellent is thy name in all the earth!",
                "NASB": "Lord, our Lord,<br>How majestic is Your name in all the earth,<br>You who have displayed Your splendor above the heavens!<br>From the mouths of infants and nursing babies You have established strength<br>Because of Your enemies,<br>To do away with the enemy and the revengeful.<br><br>When I consider Your heavens, the work of Your fingers,<br>The moon and the stars, which You have set in place;<br>What is man that You think of him,<br>And a son of man that You are concerned about him?<br>Yet You have made him a little lower than God,<br>And You crown him with glory and majesty!<br>You have him rule over the works of Your hands;<br>You have put everything under his feet,<br>All sheep and oxen,<br>And also the animals of the field,<br>The birds of the sky, and the fish of the sea,<br>Whatever passes through the paths of the seas.<br><br>Lord, our Lord,<br>How majestic is Your name in all the earth!",
                "NIV": "Lord, our Lord,<br>    how majestic is your name in all the earth!<br><br>You have set your glory<br>    in the heavens.<br>Through the praise of children and infants<br>    you have established a stronghold against your enemies,<br>    to silence the foe and the avenger.<br>When I consider your heavens,<br>    the work of your fingers,<br>the moon and the stars,<br>    which you have set in place,<br>what is mankind that you are mindful of them,<br>    human beings that you care for them?<br><br>You have made them a little lower than the angels<br>    and crowned them with glory and honor.<br>You made them rulers over the works of your hands;<br>    you put everything under their feet:<br>all flocks and herds,<br>    and the animals of the wild,<br>the birds in the sky,<br>    and the fish in the sea,<br>    all that swim the paths of the seas.<br><br>Lord, our Lord,<br>    how majestic is your name in all the earth!",
                "NKJV": "O Lord, our Lord,<br>How excellent is Your name in all the earth,<br>Who have set Your glory above the heavens!<br><br>Out of the mouth of babes and nursing infants<br>You have ordained strength,<br>Because of Your enemies,<br>That You may silence the enemy and the avenger.<br><br>When I consider Your heavens, the work of Your fingers,<br>The moon and the stars, which You have ordained,<br>What is man that You are mindful of him,<br>And the son of man that You visit him?<br>For You have made him a little lower than the angels,<br>And You have crowned him with glory and honor.<br><br>You have made him to have dominion over the works of Your hands;<br>You have put all things under his feet,<br>All sheep and oxen—<br>Even the beasts of the field,<br>The birds of the air,<br>And the fish of the sea<br>That pass through the paths of the seas.<br><br>O Lord, our Lord,<br>How excellent is Your name in all the earth!"
            },
            {
                "reference": "Psalm 16:11",
                "ESV": "You make known to me the path of life;<br>    in your presence there is fullness of joy;<br>    at your right hand are pleasures forevermore.",
                "KJV": "Thou wilt shew me the path of life: in thy presence is fulness of joy; at thy right hand there are pleasures for evermore.",
                "NASB": "You will make known to me the way of life;<br>In Your presence is fullness of joy;<br>In Your right hand there are pleasures forever.",
                "NIV": "You make known to me the path of life;<br>    you will fill me with joy in your presence,<br>    with eternal pleasures at your right hand.",
                "NKJV": "You will show me the path of life;<br>In Your presence is fullness of joy;<br>At Your right hand are pleasures forevermore."
            },
            {
                "reference": "Psalm 19:1-2",
                "ESV": "The heavens declare the glory of God,<br>    and the sky above proclaims his handiwork.<br>Day to day pours out speech,<br>    and night to night reveals knowledge.",
                "KJV": "The heavens declare the glory of God; and the firmament sheweth his handywork.<br><br>Day unto day uttereth speech, and night unto night sheweth knowledge.",
                "NASB": "The heavens tell of the glory of God;<br>And their expanse declares the work of His hands.<br>Day to day pours forth speech,<br>And night to night reveals knowledge.",
                "NIV": "The heavens declare the glory of God;<br>    the skies proclaim the work of his hands.<br>Day after day they pour forth speech;<br>    night after night they reveal knowledge.",
                "NKJV": "The heavens declare the glory of God;<br>And the firmament shows His handiwork.<br>Day unto day utters speech,<br>And night unto night reveals knowledge."
            },
            {
                "reference": "Psalm 19:7",
                "ESV": "The law of the Lord is perfect,<br>    reviving the soul;<br>the testimony of the Lord is sure,<br>    making wise the simple;",
                "KJV": "The law of the Lord is perfect, converting the soul: the testimony of the Lord is sure, making wise the simple.",
                "NASB": "The Law of the Lord is perfect, restoring the soul;<br>The testimony of the Lord is sure, making wise the simple.",
                "NIV": "The law of the Lord is perfect,<br>    refreshing the soul.<br>The statutes of the Lord are trustworthy,<br>    making wise the simple.",
                "NKJV": "The law of the Lord is perfect, converting the soul;<br>The testimony of the Lord is sure, making wise the simple;"
            },
            {
                "reference": "Psalm 20:7",
                "ESV": "Some trust in chariots and some in horses,<br>    but we trust in the name of the Lord our God.",
                "KJV": "Some trust in chariots, and some in horses: but we will remember the name of the Lord our God.",
                "NASB": "Some praise their chariots and some their horses,<br>But we will praise the name of the Lord, our God.",
                "NIV": "Some trust in chariots and some in horses,<br>    but we trust in the name of the Lord our God.",
                "NKJV": "Some trust in chariots, and some in horses;<br>But we will remember the name of the Lord our God."
            },
            {
                "reference": "Psalm 22:1",
                "ESV": "My God, my God, why have you forsaken me?<br>    Why are you so far from saving me, from the words of my groaning?",
                "KJV": "My God, my God, why hast thou forsaken me? why art thou so far from helping me, and from the words of my roaring?",
                "NASB": "My God, my God, why have You forsaken me?<br>Far from my help are the words of my groaning.",
                "NIV": "My God, my God, why have you forsaken me?<br>    Why are you so far from saving me,<br>    so far from my cries of anguish?",
                "NKJV": "My God, My God, why have You forsaken Me?<br>Why are You so far from helping Me,<br>And from the words of My groaning?"
            },
            {
                "reference": "Psalm 23",
                "ESV": "The Lord is my shepherd; I shall not want.<br>    He makes me lie down in green pastures.<br>He leads me beside still waters.<br>    He restores my soul.<br>He leads me in paths of righteousness<br>    for his name's sake.<br><br>Even though I walk through the valley of the shadow of death,<br>    I will fear no evil,<br>for you are with me;<br>    your rod and your staff,<br>    they comfort me.<br><br>You prepare a table before me<br>    in the presence of my enemies;<br>you anoint my head with oil;<br>    my cup overflows.<br>Surely goodness and mercy shall follow me<br>    all the days of my life,<br>and I shall dwell in the house of the Lord<br>    forever.",
                "KJV": "The Lord is my shepherd; I shall not want.<br><br>He maketh me to lie down in green pastures: he leadeth me beside the still waters.<br><br>He restoreth my soul: he leadeth me in the paths of righteousness for his name's sake.<br><br>Yea, though I walk through the valley of the shadow of death, I will fear no evil: for thou art with me; thy rod and thy staff they comfort me.<br><br>Thou preparest a table before me in the presence of mine enemies: thou anointest my head with oil; my cup runneth over.<br><br>Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the Lord for ever.",
                "NASB": "The Lord is my shepherd,<br>I will not be in need.<br>He lets me lie down in green pastures;<br>He leads me beside quiet waters.<br>He restores my soul;<br>He guides me in the paths of righteousness<br>For the sake of His name.<br><br>Even though I walk through the valley of the shadow of death,<br>I fear no evil, for You are with me;<br>Your rod and Your staff, they comfort me.<br>You prepare a table before me in the presence of my enemies;<br>You have anointed my head with oil;<br>My cup overflows.<br>Certainly goodness and faithfulness will follow me all the days of my life,<br>And my dwelling will be in the house of the Lord forever.",
                "NIV": "The Lord is my shepherd, I lack nothing.<br>    He makes me lie down in green pastures,<br>he leads me beside quiet waters,<br>    he refreshes my soul.<br>He guides me along the right paths<br>    for his name’s sake.<br>Even though I walk<br>    through the darkest valley,<br>I will fear no evil,<br>    for you are with me;<br>your rod and your staff,<br>    they comfort me.<br><br>You prepare a table before me<br>    in the presence of my enemies.<br>You anoint my head with oil;<br>    my cup overflows.<br>Surely your goodness and love will follow me<br>    all the days of my life,<br>and I will dwell in the house of the Lord<br>    forever.",
                "NKJV": "The Lord is my shepherd;<br>I shall not want.<br>He makes me to lie down in green pastures;<br>He leads me beside the still waters.<br>He restores my soul;<br>He leads me in the paths of righteousness<br>For His name’s sake.<br><br>Yea, though I walk through the valley of the shadow of death,<br>I will fear no evil;<br>For You are with me;<br>Your rod and Your staff, they comfort me.<br><br>You prepare a table before me in the presence of my enemies;<br>You anoint my head with oil;<br>My cup runs over.<br>Surely goodness and mercy shall follow me<br>All the days of my life;<br>And I will dwell in the house of the Lord<br>Forever."
            },
            {
                "reference": "Psalm 24:7-10",
                "ESV": "Lift up your heads, O gates!<br>    And be lifted up, O ancient doors,<br>    that the King of glory may come in.<br>Who is this King of glory?<br>    The Lord, strong and mighty,<br>    the Lord, mighty in battle!<br>Lift up your heads, O gates!<br>    And lift them up, O ancient doors,<br>    that the King of glory may come in.<br>Who is this King of glory?<br>    The Lord of hosts,<br>    he is the King of glory! Selah",
                "KJV": "Lift up your heads, O ye gates; and be ye lift up, ye everlasting doors; and the King of glory shall come in.<br><br>Who is this King of glory? The Lord strong and mighty, the Lord mighty in battle.<br><br>Lift up your heads, O ye gates; even lift them up, ye everlasting doors; and the King of glory shall come in.<br><br>Who is this King of glory? The Lord of hosts, he is the King of glory. Selah.",
                "NASB": "Lift up your heads, you gates,<br>And be lifted up, you ancient doors,<br>That the King of glory may come in!<br>Who is the King of glory?<br>The Lord strong and mighty,<br>The Lord mighty in battle.<br>Lift up your heads, you gates,<br>And lift them up, you ancient doors,<br>That the King of glory may come in!<br>Who is this King of glory?<br>The Lord of armies,<br>He is the King of glory. Selah",
                "NIV": "Lift up your heads, you gates;<br>    be lifted up, you ancient doors,<br>    that the King of glory may come in.<br>Who is this King of glory?<br>    The Lord strong and mighty,<br>    the Lord mighty in battle.<br>Lift up your heads, you gates;<br>    lift them up, you ancient doors,<br>    that the King of glory may come in.<br>Who is he, this King of glory?<br>    The Lord Almighty—<br>    he is the King of glory.",
                "NKJV": "Lift up your heads, O you gates!<br>And be lifted up, you everlasting doors!<br>And the King of glory shall come in.<br>Who is this King of glory?<br>The Lord strong and mighty,<br>The Lord mighty in battle.<br>Lift up your heads, O you gates!<br>Lift up, you everlasting doors!<br>And the King of glory shall come in.<br>Who is this King of glory?<br>The Lord of hosts,<br>He is the King of glory. Selah"
            },
            {
                "reference": "Psalm 27:4",
                "ESV": "One thing have I asked of the Lord,<br>    that will I seek after:<br>that I may dwell in the house of the Lord<br>    all the days of my life,<br>to gaze upon the beauty of the Lord<br>    and to inquire in his temple.",
                "KJV": "One thing have I desired of the Lord, that will I seek after; that I may dwell in the house of the Lord all the days of my life, to behold the beauty of the Lord, and to enquire in his temple.",
                "NASB": "One thing I have asked from the Lord, that I shall seek:<br>That I may dwell in the house of the Lord all the days of my life,<br>To behold the beauty of the Lord<br>And to meditate in His temple.",
                "NIV": "One thing I ask from the Lord,<br>    this only do I seek:<br>that I may dwell in the house of the Lord<br>    all the days of my life,<br>to gaze on the beauty of the Lord<br>    and to seek him in his temple.",
                "NKJV": "One thing I have desired of the Lord,<br>That will I seek:<br>That I may dwell in the house of the Lord<br>All the days of my life,<br>To behold the beauty of the Lord,<br>And to inquire in His temple."
            },
            {
                "reference": "Psalm 29:1-2",
                "ESV": "Ascribe to the Lord, O heavenly beings,<br>    ascribe to the Lord glory and strength.<br>Ascribe to the Lord the glory due his name;<br>    worship the Lord in the splendor of holiness.",
                "KJV": "Give unto the Lord, O ye mighty, give unto the Lord glory and strength.<br><br>Give unto the Lord the glory due unto his name; worship the Lord in the beauty of holiness.",
                "NASB": "Ascribe to the Lord, sons of the mighty,<br>Ascribe to the Lord glory and strength.<br>Ascribe to the Lord the glory due His name;<br>Worship the Lord in holy attire.",
                "NIV": "Ascribe to the Lord, you heavenly beings,<br>    ascribe to the Lord glory and strength.<br>Ascribe to the Lord the glory due his name;<br>    worship the Lord in the splendor of his holiness.",
                "NKJV": "Give unto the Lord, O you mighty ones,<br>Give unto the Lord glory and strength.<br>Give unto the Lord the glory due to His name;<br>Worship the Lord in the beauty of holiness."
            },
            {
                "reference": "Psalm 34:8",
                "ESV": "Oh, taste and see that the Lord is good!<br>    Blessed is the man who takes refuge in him!",
                "KJV": "O taste and see that the Lord is good: blessed is the man that trusteth in him.",
                "NASB": "Taste and see that the Lord is good;<br>How blessed is the man who takes refuge in Him!",
                "NIV": "Taste and see that the Lord is good;<br>    blessed is the one who takes refuge in him.",
                "NKJV": "Oh, taste and see that the Lord is good;<br>Blessed is the man who trusts in Him!"
            },
            {
                "reference": "Psalm 42:1",
                "ESV": "As a deer pants for flowing streams,<br>    so pants my soul for you, O God.",
                "KJV": "As the hart panteth after the water brooks, so panteth my soul after thee, O God.",
                "NASB": "As the deer pants for the water brooks,<br>So my soul pants for You, God.",
                "NIV": "As the deer pants for streams of water,<br>    so my soul pants for you, my God.",
                "NKJV": "As the deer pants for the water brooks,<br>So pants my soul for You, O God."
            },
            {
                "reference": "Psalm 43:3-4",
                "ESV": "Send out your light and your truth;<br>    let them lead me;<br>let them bring me to your holy hill<br>    and to your dwelling!<br>Then I will go to the altar of God,<br>    to God my exceeding joy,<br>and I will praise you with the lyre,<br>    O God, my God.",
                "KJV": "O send out thy light and thy truth: let them lead me; let them bring me unto thy holy hill, and to thy tabernacles.<br><br>Then will I go unto the altar of God, unto God my exceeding joy: yea, upon the harp will I praise thee, O God my God.",
                "NASB": "Send out Your light and Your truth, they shall lead me;<br>They shall bring me to Your holy hill<br>And to Your dwelling places.<br>Then I will go to the altar of God,<br>To God my exceeding joy;<br>And I will praise You on the lyre, God, my God.",
                "NIV": "Send me your light and your faithful care,<br>    let them lead me;<br>let them bring me to your holy mountain,<br>    to the place where you dwell.<br>Then I will go to the altar of God,<br>    to God, my joy and my delight.<br>I will praise you with the lyre,<br>    O God, my God.",
                "NKJV": "Oh, send out Your light and Your truth!<br>Let them lead me;<br>Let them bring me to Your holy hill<br>And to Your tabernacle.<br>Then I will go to the altar of God,<br>To God my exceeding joy;<br>And on the harp I will praise You,<br>O God, my God."
            },
            {
                "reference": "Psalm 46",
                "ESV": "God is our refuge and strength,<br>    a very present help in trouble.<br>Therefore we will not fear though the earth gives way,<br>    though the mountains be moved into the heart of the sea,<br>though its waters roar and foam,<br>    though the mountains tremble at its swelling. Selah<br><br>There is a river whose streams make glad the city of God,<br>    the holy habitation of the Most High.<br>God is in the midst of her; she shall not be moved;<br>    God will help her when morning dawns.<br>The nations rage, the kingdoms totter;<br>    he utters his voice, the earth melts.<br>The Lord of hosts is with us;<br>    the God of Jacob is our fortress. Selah<br><br>Come, behold the works of the Lord,<br>    how he has brought desolations on the earth.<br>He makes wars cease to the end of the earth;<br>    he breaks the bow and shatters the spear;<br>    he burns the chariots with fire.<br>“Be still, and know that I am God.<br>    I will be exalted among the nations,<br>    I will be exalted in the earth!”<br>The Lord of hosts is with us;<br>    the God of Jacob is our fortress. Selah",
                "KJV": "God is our refuge and strength, a very present help in trouble.<br><br>Therefore will not we fear, though the earth be removed, and though the mountains be carried into the midst of the sea;<br><br>Though the waters thereof roar and be troubled, though the mountains shake with the swelling thereof. Selah.<br><br>There is a river, the streams whereof shall make glad the city of God, the holy place of the tabernacles of the most High.<br><br>God is in the midst of her; she shall not be moved: God shall help her, and that right early.<br><br>The heathen raged, the kingdoms were moved: he uttered his voice, the earth melted.<br><br>The Lord of hosts is with us; the God of Jacob is our refuge. Selah.<br><br>Come, behold the works of the Lord, what desolations he hath made in the earth.<br><br>He maketh wars to cease unto the end of the earth; he breaketh the bow, and cutteth the spear in sunder; he burneth the chariot in the fire.<br><br>Be still, and know that I am God: I will be exalted among the heathen, I will be exalted in the earth.<br><br>The Lord of hosts is with us; the God of Jacob is our refuge. Selah.",
                "NASB": "God is our refuge and strength,<br>A very ready help in trouble.<br>Therefore we will not fear, though the earth shakes<br>And the mountains slip into the heart of the sea;<br>Though its waters roar and foam,<br>Though the mountains quake at its swelling pride. Selah<br><br>There is a river whose streams make the city of God happy,<br>The holy dwelling places of the Most High.<br>God is in the midst of her, she will not be moved;<br>God will help her when morning dawns.<br>The nations made an uproar, the kingdoms tottered;<br>He raised His voice, the earth quaked.<br>The Lord of armies is with us;<br>The God of Jacob is our stronghold. Selah<br><br>Come, behold the works of the Lord,<br>Who has inflicted horrific events on the earth.<br>He makes wars to cease to the end of the earth;<br>He breaks the bow and cuts the spear in two;<br>He burns the chariots with fire.<br>“Stop striving and know that I am God;<br>I will be exalted among the nations, I will be exalted on the earth.”<br>The Lord of armies is with us;<br>The God of Jacob is our stronghold. Selah",
                "NIV": "God is our refuge and strength,<br>    an ever-present help in trouble.<br>Therefore we will not fear, though the earth give way<br>    and the mountains fall into the heart of the sea,<br>though its waters roar and foam<br>    and the mountains quake with their surging.<br><br>There is a river whose streams make glad the city of God,<br>    the holy place where the Most High dwells.<br>God is within her, she will not fall;<br>    God will help her at break of day.<br>Nations are in uproar, kingdoms fall;<br>    he lifts his voice, the earth melts.<br><br>The Lord Almighty is with us;<br>    the God of Jacob is our fortress.<br><br>Come and see what the Lord has done,<br>    the desolations he has brought on the earth.<br>He makes wars cease<br>    to the ends of the earth.<br>He breaks the bow and shatters the spear;<br>    he burns the shields with fire.<br>He says, “Be still, and know that I am God;<br>    I will be exalted among the nations,<br>    I will be exalted in the earth.”<br><br>The Lord Almighty is with us;<br>    the God of Jacob is our fortress.",
                "NKJV": "God is our refuge and strength,<br>A very present help in trouble.<br>Therefore we will not fear,<br>Even though the earth be removed,<br>And though the mountains be carried into the midst of the sea;<br>Though its waters roar and be troubled,<br>Though the mountains shake with its swelling. Selah<br><br>There is a river whose streams shall make glad the city of God,<br>The holy place of the tabernacle of the Most High.<br>God is in the midst of her, she shall not be moved;<br>God shall help her, just at the break of dawn.<br>The nations raged, the kingdoms were moved;<br>He uttered His voice, the earth melted.<br><br>The Lord of hosts is with us;<br>The God of Jacob is our refuge. Selah<br><br>Come, behold the works of the Lord,<br>Who has made desolations in the earth.<br>He makes wars cease to the end of the earth;<br>He breaks the bow and cuts the spear in two;<br>He burns the chariot in the fire.<br><br>Be still, and know that I am God;<br>I will be exalted among the nations,<br>I will be exalted in the earth!<br><br>The Lord of hosts is with us;<br>The God of Jacob is our refuge. Selah"
            },
            {
                "reference": "Psalm 46:10",
                "ESV": "“Be still, and know that I am God.<br>    I will be exalted among the nations,<br>    I will be exalted in the earth!”",
                "KJV": "Be still, and know that I am God: I will be exalted among the heathen, I will be exalted in the earth.",
                "NASB": "“Stop striving and know that I am God;<br>I will be exalted among the nations, I will be exalted on the earth.”",
                "NIV": "He says, “Be still, and know that I am God;<br>    I will be exalted among the nations,<br>    I will be exalted in the earth.”",
                "NKJV": "Be still, and know that I am God;<br>I will be exalted among the nations,<br>I will be exalted in the earth!"
            },
            {
                "reference": "Psalm 51:10-12",
                "ESV": "Create in me a clean heart, O God,<br>    and renew a right spirit within me.<br>Cast me not away from your presence,<br>    and take not your Holy Spirit from me.<br>Restore to me the joy of your salvation,<br>    and uphold me with a willing spirit.",
                "KJV": "Create in me a clean heart, O God; and renew a right spirit within me.<br><br>Cast me not away from thy presence; and take not thy holy spirit from me.<br><br>Restore unto me the joy of thy salvation; and uphold me with thy free spirit.",
                "NASB": "Create in me a clean heart, God,<br>And renew a steadfast spirit within me.<br>Do not cast me away from Your presence,<br>And do not take Your Holy Spirit from me.<br>Restore to me the joy of Your salvation,<br>And sustain me with a willing spirit.",
                "NIV": "Create in me a pure heart, O God,<br>    and renew a steadfast spirit within me.<br>Do not cast me from your presence<br>    or take your Holy Spirit from me.<br>Restore to me the joy of your salvation<br>    and grant me a willing spirit, to sustain me.",
                "NKJV": "Create in me a clean heart, O God,<br>And renew a steadfast spirit within me.<br>Do not cast me away from Your presence,<br>And do not take Your Holy Spirit from me.<br><br>Restore to me the joy of Your salvation,<br>And uphold me by Your generous Spirit."
            },
            {
                "reference": "Psalm 84:1-2",
                "ESV": "How lovely is your dwelling place,<br>    O Lord of hosts!<br>My soul longs, yes, faints<br>    for the courts of the Lord;<br>my heart and flesh sing for joy<br>    to the living God.",
                "KJV": "How amiable are thy tabernacles, O Lord of hosts!<br><br>My soul longeth, yea, even fainteth for the courts of the Lord: my heart and my flesh crieth out for the living God.",
                "NASB": "How lovely are Your dwelling places,<br>Lord of armies!<br>My soul longed and even yearned for the courtyards of the Lord;<br>My heart and my flesh sing for joy to the living God.",
                "NIV": "How lovely is your dwelling place,<br>    Lord Almighty!<br>My soul yearns, even faints,<br>    for the courts of the Lord;<br>my heart and my flesh cry out<br>    for the living God.",
                "NKJV": "How lovely is Your tabernacle,<br>O Lord of hosts!<br>My soul longs, yes, even faints<br>For the courts of the Lord;<br>My heart and my flesh cry out for the living God."
            },
            {
                "reference": "Psalm 86:11",
                "ESV": "Teach me your way, O Lord,<br>    that I may walk in your truth;<br>    unite my heart to fear your name.",
                "KJV": "Teach me thy way, O Lord; I will walk in thy truth: unite my heart to fear thy name.",
                "NASB": "Teach me Your way, Lord;<br>I will walk in Your truth;<br>Unite my heart to fear Your name.",
                "NIV": "Teach me your way, Lord,<br>    that I may rely on your faithfulness;<br>give me an undivided heart,<br>    that I may fear your name.",
                "NKJV": "Teach me Your way, O Lord;<br>I will walk in Your truth;<br>Unite my heart to fear Your name."
            },
            {
                "reference": "Psalm 90:14",
                "ESV": "Satisfy us in the morning with your steadfast love,<br>    that we may rejoice and be glad all our days.",
                "KJV": "O satisfy us early with thy mercy; that we may rejoice and be glad all our days.",
                "NASB": "Satisfy us in the morning with Your graciousness,<br>That we may sing for joy and rejoice all our days.",
                "NIV": "Satisfy us in the morning with your unfailing love,<br>    that we may sing for joy and be glad all our days.",
                "NKJV": "Oh, satisfy us early with Your mercy,<br>That we may rejoice and be glad all our days!"
            },
            {
                "reference": "Psalm 91:1-2",
                "ESV": "He who dwells in the shelter of the Most High<br>    will abide in the shadow of the Almighty.<br>I will say to the Lord, “My refuge and my fortress,<br>    my God, in whom I trust.”",
                "KJV": "He that dwelleth in the secret place of the most High shall abide under the shadow of the Almighty.<br><br>I will say of the Lord, He is my refuge and my fortress: my God; in him will I trust.",
                "NASB": "One who dwells in the shelter of the Most High<br>Will lodge in the shadow of the Almighty.<br>I will say to the Lord, “My refuge and my fortress,<br>My God, in whom I trust!”",
                "NIV": "Whoever dwells in the shelter of the Most High<br>    will rest in the shadow of the Almighty.<br>I will say of the Lord, “He is my refuge and my fortress,<br>    my God, in whom I trust.”",
                "NKJV": "He who dwells in the secret place of the Most High<br>Shall abide under the shadow of the Almighty.<br>I will say of the Lord, “He is my refuge and my fortress;<br>My God, in Him I will trust.”"
            },
            {
                "reference": "Psalm 115:1",
                "ESV": "Not to us, O Lord, not to us, but to your name give glory,<br>    for the sake of your steadfast love and your faithfulness!",
                "KJV": "Not unto us, O Lord, not unto us, but unto thy name give glory, for thy mercy, and for thy truth's sake.",
                "NASB": "Not to us, Lord, not to us,<br>But to Your name give glory,<br>Because of Your mercy, because of Your truth.",
                "NIV": "Not to us, Lord, not to us<br>    but to your name be the glory,<br>    because of your love and faithfulness.",
                "NKJV": "Not unto us, O Lord, not unto us,<br>But to Your name give glory,<br>Because of Your mercy,<br>Because of Your truth."
            },
            {
                "reference": "Psalm 119:11",
                "ESV": "I have stored up your word in my heart,<br>    that I might not sin against you.",
                "KJV": "Thy word have I hid in mine heart, that I might not sin against thee.",
                "NASB": "I have treasured Your word in my heart,<br>So that I may not sin against You.",
                "NIV": "I have hidden your word in my heart<br>    that I might not sin against you.",
                "NKJV": "Your word I have hidden in my heart,<br>That I might not sin against You."
            },
            {
                "reference": "Psalm 119:18",
                "ESV": "Open my eyes, that I may behold<br>    wondrous things out of your law.",
                "KJV": "Open thou mine eyes, that I may behold wondrous things out of thy law.",
                "NASB": "Open my eyes, that I may behold<br>Wonderful things from Your Law.",
                "NIV": "Open my eyes that I may see<br>    wonderful things in your law.",
                "NKJV": "Open my eyes, that I may see<br>Wondrous things from Your law."
            },
            {
                "reference": "Psalm 119:36",
                "ESV": "Incline my heart to your testimonies,<br>    and not to selfish gain!",
                "KJV": "Incline my heart unto thy testimonies, and not to covetousness.",
                "NASB": "Incline my heart to Your testimonies,<br>And not to dishonest gain.",
                "NIV": "Turn my heart toward your statutes<br>    and not toward selfish gain.",
                "NKJV": "Incline my heart to Your testimonies,<br>And not to covetousness."
            },
            {
                "reference": "Psalm 119:105",
                "ESV": "Your word is a lamp to my feet<br>    and a light to my path.",
                "KJV": "Thy word is a lamp unto my feet, and a light unto my path.",
                "NASB": "Your word is a lamp to my feet<br>And a light to my path.",
                "NIV": "Your word is a lamp for my feet,<br>    a light on my path.",
                "NKJV": "Your word is a lamp to my feet<br>And a light to my path."
            },
            {
                "reference": "Psalm 121:1-2",
                "ESV": "I lift up my eyes to the hills.<br>    From where does my help come?<br>My help comes from the Lord,<br>    who made heaven and earth.",
                "KJV": "I will lift up mine eyes unto the hills, from whence cometh my help.<br><br>My help cometh from the Lord, which made heaven and earth.",
                "NASB": "I will raise my eyes to the mountains;<br>From where will my help come?<br>My help comes from the Lord,<br>Who made heaven and earth.",
                "NIV": "I lift up my eyes to the mountains—<br>    where does my help come from?<br>My help comes from the Lord,<br>    the Maker of heaven and earth.",
                "NKJV": "I will lift up my eyes to the hills—<br>From whence comes my help?<br>My help comes from the Lord,<br>Who made heaven and earth."
            },
            {
                "reference": "Psalm 127:1",
                "ESV": "Unless the Lord builds the house,<br>    those who build it labor in vain.<br>Unless the Lord watches over the city,<br>    the watchman stays awake in vain.",
                "KJV": "Except the Lord build the house, they labour in vain that build it: except the Lord keep the city, the watchman waketh but in vain.",
                "NASB": "Unless the Lord builds a house,<br>They who build it labor in vain;<br>Unless the Lord guards a city,<br>The watchman stays awake in vain.",
                "NIV": "Unless the Lord builds the house,<br>    the builders labor in vain.<br>Unless the Lord watches over the city,<br>    the guards stand watch in vain.",
                "NKJV": "Unless the Lord builds the house,<br>They labor in vain who build it;<br>Unless the Lord guards the city,<br>The watchman stays awake in vain."
            },
            {
                "reference": "Psalm 136:1",
                "ESV": "Give thanks to the Lord, for he is good,<br>    for his steadfast love endures forever.",
                "KJV": "O give thanks unto the Lord; for he is good: for his mercy endureth for ever.",
                "NASB": "Give thanks to the Lord, for He is good,<br>For His faithfulness is everlasting.",
                "NIV": "Give thanks to the Lord, for he is good.<br>His love endures forever.",
                "NKJV": "Oh, give thanks to the Lord, for He is good!<br>For His mercy endures forever."
            },
            {
                "reference": "Psalm 139:13-14",
                "ESV": "For you formed my inward parts;<br>    you knitted me together in my mother's womb.<br>I praise you, for I am fearfully and wonderfully made.<br>Wonderful are your works;<br>    my soul knows it very well.",
                "KJV": "For thou hast possessed my reins: thou hast covered me in my mother's womb.<br><br>I will praise thee; for I am fearfully and wonderfully made: marvellous are thy works; and that my soul knoweth right well.",
                "NASB": "For You created my innermost parts;<br>You wove me in my mother’s womb.<br>I will give thanks to You, because I am awesomely and wonderfully made;<br>Wonderful are Your works,<br>And my soul knows it very well.",
                "NIV": "For you created my inmost being;<br>    you knit me together in my mother’s womb.<br>I praise you because I am fearfully and wonderfully made;<br>    your works are wonderful,<br>    I know that full well.",
                "NKJV": "For You formed my inward parts;<br>You covered me in my mother’s womb.<br>I will praise You, for I am fearfully and wonderfully made;<br>Marvelous are Your works,<br>And that my soul knows very well."
            }
        ],
        "Proverbs": [
            {
                "reference": "Proverbs 1:7",
                "ESV": "The fear of the Lord is the beginning of knowledge;<br>    fools despise wisdom and instruction.",
                "KJV": "The fear of the Lord is the beginning of knowledge: but fools despise wisdom and instruction.",
                "NASB": "The fear of the Lord is the beginning of knowledge;<br>Fools despise wisdom and instruction.",
                "NIV": "The fear of the Lord is the beginning of knowledge,<br>    but fools despise wisdom and instruction.",
                "NKJV": "The fear of the Lord is the beginning of knowledge,<br>But fools despise wisdom and instruction."
            },
            {
                "reference": "Proverbs 3:5-6",
                "ESV": "Trust in the Lord with all your heart,<br>    and do not lean on your own understanding.<br>In all your ways acknowledge him,<br>    and he will make straight your paths.",
                "KJV": "Trust in the Lord with all thine heart; and lean not unto thine own understanding.<br><br>In all thy ways acknowledge him, and he shall direct thy paths.",
                "NASB": "Trust in the Lord with all your heart<br>And do not lean on your own understanding.<br>In all your ways acknowledge Him,<br>And He will make your paths straight.",
                "NIV": "Trust in the Lord with all your heart<br>    and lean not on your own understanding;<br>in all your ways submit to him,<br>    and he will make your paths straight.",
                "NKJV": "Trust in the Lord with all your heart,<br>And lean not on your own understanding;<br>In all your ways acknowledge Him,<br>And He shall direct your paths."
            },
            {
                "reference": "Proverbs 3:27",
                "ESV": "Do not withhold good from those to whom it is due,<br>    when it is in your power to do it.",
                "KJV": "Withhold not good from them to whom it is due, when it is in the power of thine hand to do it.",
                "NASB": "Do not withhold good from those to whom it is due,<br>When it is in your power to do it.",
                "NIV": "Do not withhold good from those to whom it is due,<br>    when it is in your power to act.",
                "NKJV": "Do not withhold good from those to whom it is due,<br>When it is in the power of your hand to do so."
            },
            {
                "reference": "Proverbs 16:18",
                "ESV": "Pride goes before destruction,<br>    and a haughty spirit before a fall.",
                "KJV": "Pride goeth before destruction, and an haughty spirit before a fall.",
                "NASB": "Pride goes before destruction,<br>And a haughty spirit before stumbling.",
                "NIV": "Pride goes before destruction,<br>    a haughty spirit before a fall.",
                "NKJV": "Pride goes before destruction,<br>And a haughty spirit before a fall."
            },
            {
                "reference": "Proverbs 21:31",
                "ESV": "The horse is made ready for the day of battle,<br>    but the victory belongs to the Lord.",
                "KJV": "The horse is prepared against the day of battle: but safety is of the Lord.",
                "NASB": "The horse is prepared for the day of battle,<br>But the victory belongs to the Lord.",
                "NIV": "The horse is made ready for the day of battle,<br>    but victory rests with the Lord.",
                "NKJV": "The horse is prepared for the day of battle,<br>But deliverance is of the Lord."
            },
            {
                "reference": "Proverbs 22:6",
                "ESV": "Train up a child in the way he should go;<br>    even when he is old he will not depart from it.",
                "KJV": "Train up a child in the way he should go: and when he is old, he will not depart from it.",
                "NASB": "Train up a child in the way he should go,<br>Even when he grows older he will not abandon it.",
                "NIV": "Start children off on the way they should go,<br>    and even when they are old they will not turn from it.",
                "NKJV": "Train up a child in the way he should go,<br>And when he is old he will not depart from it."
            },
            {
                "reference": "Proverbs 27:17",
                "ESV": "Iron sharpens iron,<br>    and one man sharpens another.",
                "KJV": "Iron sharpeneth iron; so a man sharpeneth the countenance of his friend.",
                "NASB": "As iron sharpens iron,<br>So one person sharpens another.",
                "NIV": "As iron sharpens iron,<br>    so one person sharpens another.",
                "NKJV": "As iron sharpens iron,<br>So a man sharpens the countenance of his friend."
            }
        ],
        "Ecclesiastes": [
            {
                "reference": "Ecclesiastes 1:2",
                "ESV": "Vanity of vanities, says the Preacher,<br>    vanity of vanities! All is vanity.",
                "KJV": "Vanity of vanities, saith the Preacher, vanity of vanities; all is vanity.",
                "NASB": "“Futility of futilities,” says the Preacher,<br>“Futility of futilities! All is futility.”",
                "NIV": "“Meaningless! Meaningless!”<br>    says the Teacher.<br>“Utterly meaningless!<br>    Everything is meaningless.”",
                "NKJV": "“Vanity of vanities,” says the Preacher;<br>“Vanity of vanities, all is vanity.”"
            },
            {
                "reference": "Ecclesiastes 1:9",
                "ESV": "What has been is what will be,<br>    and what has been done is what will be done,<br>    and there is nothing new under the sun.",
                "KJV": "The thing that hath been, it is that which shall be; and that which is done is that which shall be done: and there is no new thing under the sun.",
                "NASB": "What has been, it is what will be,<br>And what has been done, it is what will be done.<br>So there is nothing new under the sun.",
                "NIV": "What has been will be again,<br>    what has been done will be done again;<br>    there is nothing new under the sun.",
                "NKJV": "That which has been is what will be,<br>That which is done is what will be done,<br>And there is nothing new under the sun."
            },
            {
                "reference": "Ecclesiastes 3:1",
                "ESV": "For everything there is a season, and a time for every matter under heaven:",
                "KJV": "To every thing there is a season, and a time to every purpose under the heaven:",
                "NASB": "There is an appointed time for everything. And there is a time for every matter under heaven—",
                "NIV": "There is a time for everything,<br>    and a season for every activity under the heavens:",
                "NKJV": "To everything there is a season,<br>A time for every purpose under heaven:"
            },
            {
                "reference": "Ecclesiastes 3:11",
                "ESV": "He has made everything beautiful in its time. Also, he has put eternity into man's heart, yet so that he cannot find out what God has done from the beginning to the end.",
                "KJV": "He hath made every thing beautiful in his time: also he hath set the world in their heart, so that no man can find out the work that God maketh from the beginning to the end.",
                "NASB": "He has made everything appropriate in its time. He has also set eternity in their heart, without the possibility that mankind will find out the work which God has done from the beginning even to the end.",
                "NIV": "He has made everything beautiful in its time. He has also set eternity in the human heart; yet no one can fathom what God has done from beginning to end.",
                "NKJV": "He has made everything beautiful in its time. Also He has put eternity in their hearts, except that no one can find out the work that God does from beginning to end."
            },
            {
                "reference": "Ecclesiastes 5:2",
                "ESV": "Be not rash with your mouth, nor let your heart be hasty to utter a word before God, for God is in heaven and you are on earth. Therefore let your words be few.",
                "KJV": "Be not rash with thy mouth, and let not thine heart be hasty to utter any thing before God: for God is in heaven, and thou upon earth: therefore let thy words be few.",
                "NASB": "Do not be quick with your mouth or impulsive in thought to bring up a matter in the presence of God. For God is in heaven and you are on the earth; therefore let your words be few.",
                "NIV": "Do not be quick with your mouth,<br>    do not be hasty in your heart<br>    to utter anything before God.<br>God is in heaven<br>    and you are on earth,<br>    so let your words be few.",
                "NKJV": "Do not be rash with your mouth,<br>And let not your heart utter anything hastily before God.<br>For God is in heaven, and you on earth;<br>Therefore let your words be few."
            }
        ],
        "Isaiah": [
            {
                "reference": "Isaiah 40:8",
                "ESV": "The grass withers, the flower fades,<br>    but the word of our God will stand forever.",
                "KJV": "The grass withereth, the flower fadeth: but the word of our God shall stand for ever.",
                "NASB": "The grass withers, the flower fades,<br>But the word of our God stands forever.",
                "NIV": "The grass withers and the flowers fall,<br>    but the word of our God endures forever.”",
                "NKJV": "The grass withers, the flower fades,<br>But the word of our God stands forever.”"
            },
            {
                "reference": "Isaiah 43:7",
                "ESV": "everyone who is called by my name,<br>    whom I created for my glory,<br>    whom I formed and made.”",
                "KJV": "Even every one that is called by my name: for I have created him for my glory, I have formed him; yea, I have made him.",
                "NASB": "Everyone who is called by My name,<br>And whom I have created for My glory,<br>Whom I have formed, even whom I have made.”",
                "NIV": "everyone who is called by my name,<br>    whom I created for my glory,<br>    whom I formed and made.”",
                "NKJV": "Everyone who is called by My name,<br>Whom I have created for My glory;<br>I have formed him, yes, I have made him.”"
            },
            {
                "reference": "Isaiah 53:3-7",
                "ESV": "He was despised and rejected by men,<br>    a man of sorrows and acquainted with grief;<br>and as one from whom men hide their faces<br>    he was despised, and we esteemed him not.<br><br>Surely he has borne our griefs<br>    and carried our sorrows;<br>yet we esteemed him stricken,<br>    smitten by God, and afflicted.<br>But he was pierced for our transgressions;<br>    he was crushed for our iniquities;<br>upon him was the chastisement that brought us peace,<br>    and with his wounds we are healed.<br>All we like sheep have gone astray;<br>    we have turned—every one—to his own way;<br>and the Lord has laid on him<br>    the iniquity of us all.<br><br>He was oppressed, and he was afflicted,<br>    yet he opened not his mouth;<br>like a lamb that is led to the slaughter,<br>    and like a sheep that before its shearers is silent,<br>    so he opened not his mouth.",
                "KJV": "He is despised and rejected of men; a man of sorrows, and acquainted with grief: and we hid as it were our faces from him; he was despised, and we esteemed him not.<br><br>Surely he hath borne our griefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted.<br><br>But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.<br><br>All we like sheep have gone astray; we have turned every one to his own way; and the Lord hath laid on him the iniquity of us all.<br><br>He was oppressed, and he was afflicted, yet he opened not his mouth: he is brought as a lamb to the slaughter, and as a sheep before her shearers is dumb, so he openeth not his mouth.",
                "NASB": "He was despised and abandoned by men,<br>A man of great pain and familiar with sickness;<br>And like one from whom people hide their faces,<br>He was despised, and we had no regard for Him.<br><br>However, it was our sicknesses that He Himself bore,<br>And our pains that He carried;<br>Yet we ourselves assumed that He had been afflicted,<br>Struck down by God, and humiliated.<br>But He was pierced for our offenses,<br>He was crushed for our wrongdoings;<br>The punishment for our well-being was laid upon Him,<br>And by His wounds we are healed.<br>All of us, like sheep, have gone astray,<br>Each of us has turned to his own way;<br>But the Lord has caused the wrongdoing of us all<br>To fall on Him.<br><br>He was oppressed and afflicted,<br>Yet He did not open His mouth;<br>Like a lamb that is led to slaughter,<br>And like a sheep that is silent before its shearers,<br>So He did not open His mouth.",
                "NIV": "He was despised and rejected by mankind,<br>    a man of suffering, and familiar with pain.<br>Like one from whom people hide their faces<br>    he was despised, and we held him in low esteem.<br><br>Surely he took up our pain<br>    and bore our suffering,<br>yet we considered him punished by God,<br>    stricken by him, and afflicted.<br>But he was pierced for our transgressions,<br>    he was crushed for our iniquities;<br>the punishment that brought us peace was on him,<br>    and by his wounds we are healed.<br>We all, like sheep, have gone astray,<br>    each of us has turned to our own way;<br>and the Lord has laid on him<br>    the iniquity of us all.<br><br>He was oppressed and afflicted,<br>    yet he did not open his mouth;<br>he was led like a lamb to the slaughter,<br>    and as a sheep before its shearers is silent,<br>    so he did not open his mouth.",
                "NKJV": "He is despised and rejected by men,<br>A Man of sorrows and acquainted with grief.<br>And we hid, as it were, our faces from Him;<br>He was despised, and we did not esteem Him.<br><br>Surely He has borne our griefs<br>And carried our sorrows;<br>Yet we esteemed Him stricken,<br>Smitten by God, and afflicted.<br>But He was wounded for our transgressions,<br>He was bruised for our iniquities;<br>The chastisement for our peace was upon Him,<br>And by His stripes we are healed.<br>All we like sheep have gone astray;<br>We have turned, every one, to his own way;<br>And the Lord has laid on Him the iniquity of us all.<br><br>He was oppressed and He was afflicted,<br>Yet He opened not His mouth;<br>He was led as a lamb to the slaughter,<br>And as a sheep before its shearers is silent,<br>So He opened not His mouth."
            },
            {
                "reference": "Isaiah 57:1-2",
                "ESV": "The righteous man perishes,<br>    and no one lays it to heart;<br>devout men are taken away,<br>    while no one understands.<br>For the righteous man is taken away from calamity;<br>    he enters into peace;<br>they rest in their beds<br>    who walk in their uprightness.",
                "KJV": "The righteous perisheth, and no man layeth it to heart: and merciful men are taken away, none considering that the righteous is taken away from the evil to come.<br><br>He shall enter into peace: they shall rest in their beds, each one walking in his uprightness.",
                "NASB": "The righteous person perishes, and no one takes it to heart;<br>And devout people are taken away, while no one understands.<br>For the righteous person is taken away from evil,<br>He enters into peace;<br>They rest in their beds,<br>Each one who walked in his upright way.",
                "NIV": "The righteous perish,<br>    and no one takes it to heart;<br>the devout are taken away,<br>    and no one understands<br>that the righteous are taken away<br>    to be spared from evil.<br>Those who walk uprightly<br>    enter into peace;<br>    they find rest as they lie in death.",
                "NKJV": "The righteous perishes,<br>And no man takes it to heart;<br>Merciful men are taken away,<br>While no one considers<br>That the righteous is taken away from evil.<br>He shall enter into peace;<br>They shall rest in their beds,<br>Each one walking in his uprightness."
            }
        ],
        "Jeremiah": [
            {
                "reference": "Jeremiah 1:4-10",
                "ESV": "Now the word of the Lord came to me, saying,<br><br>“Before I formed you in the womb I knew you,<br>and before you were born I consecrated you;<br>I appointed you a prophet to the nations.”<br><br>Then I said, “Ah, Lord God! Behold, I do not know how to speak, for I am only a youth.” But the Lord said to me,<br><br>“Do not say, ‘I am only a youth’;<br>for to all to whom I send you, you shall go,<br>and whatever I command you, you shall speak.<br>Do not be afraid of them,<br>for I am with you to deliver you,<br>declares the Lord.”<br><br>Then the Lord put out his hand and touched my mouth. And the Lord said to me,<br><br>“Behold, I have put my words in your mouth.<br>See, I have set you this day over nations and over kingdoms,<br>to pluck up and to break down,<br>to destroy and to overthrow,<br>to build and to plant.”",
                "KJV": "Then the word of the Lord came unto me, saying,<br><br>Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations.<br><br>Then said I, Ah, Lord God! behold, I cannot speak: for I am a child.<br><br>But the Lord said unto me, Say not, I am a child: for thou shalt go to all that I shall send thee, and whatsoever I command thee thou shalt speak.<br><br>Be not afraid of their faces: for I am with thee to deliver thee, saith the Lord.<br><br>Then the Lord put forth his hand, and touched my mouth. And the Lord said unto me, Behold, I have put my words in thy mouth.<br><br>See, I have this day set thee over the nations and over the kingdoms, to root out, and to pull down, and to destroy, and to throw down, to build, and to plant.",
                "NASB": "Now the word of the Lord came to me, saying,<br><br>“Before I formed you in the womb I knew you,<br>And before you were born I consecrated you;<br>I have appointed you as a prophet to the nations.”<br>Then I said, “Oh, Lord God!<br>Behold, I do not know how to speak,<br>Because I am a youth.”<br>But the Lord said to me,<br>“Do not say, ‘I am a youth,’<br>Because everywhere I send you, you shall go,<br>And all that I command you, you shall speak.<br>Do not be afraid of them,<br>For I am with you to save you,” declares the Lord.<br><br>Then the Lord stretched out His hand and touched my mouth, and the Lord said to me,<br><br>“Behold, I have put My words in your mouth.<br>See, I have appointed you this day over the nations and over the kingdoms,<br>To root out and to tear down,<br>To destroy and to overthrow,<br>To build and to plant.”",
                "NIV": "The word of the Lord came to me, saying,<br><br>“Before I formed you in the womb I knew you,<br>    before you were born I set you apart;<br>    I appointed you as a prophet to the nations.”<br><br>“Alas, Sovereign Lord,” I said, “I do not know how to speak; I am too young.”<br><br>But the Lord said to me, “Do not say, ‘I am too young.’ You must go to everyone I send you to and say whatever I command you. Do not be afraid of them, for I am with you and will rescue you,” declares the Lord.<br><br>Then the Lord reached out his hand and touched my mouth and said to me, “I have put my words in your mouth. See, today I appoint you over nations and kingdoms to uproot and tear down, to destroy and overthrow, to build and to plant.”",
                "NKJV": "Then the word of the Lord came to me, saying:<br><br>“Before I formed you in the womb I knew you;<br>Before you were born I sanctified you;<br>I ordained you a prophet to the nations.”<br><br>Then said I:<br><br>“Ah, Lord God!<br>Behold, I cannot speak, for I am a youth.”<br><br>But the Lord said to me:<br><br>“Do not say, ‘I am a youth,’<br>For you shall go to all to whom I send you,<br>And whatever I command you, you shall speak.<br>Do not be afraid of their faces,<br>For I am with you to deliver you,” says the Lord.<br><br>Then the Lord put forth His hand and touched my mouth, and the Lord said to me:<br><br>“Behold, I have put My words in your mouth.<br>See, I have this day set you over the nations and over the kingdoms,<br>To root out and to pull down,<br>To destroy and to throw down,<br>To build and to plant.”"
            },
            {
                "reference": "Jeremiah 9:23-24",
                "ESV": "Thus says the Lord: “Let not the wise man boast in his wisdom, let not the mighty man boast in his might, let not the rich man boast in his riches, but let him who boasts boast in this, that he understands and knows me, that I am the Lord who practices steadfast love, justice, and righteousness in the earth. For in these things I delight, declares the Lord.”",
                "KJV": "Thus saith the Lord, Let not the wise man glory in his wisdom, neither let the mighty man glory in his might, let not the rich man glory in his riches:<br><br>But let him that glorieth glory in this, that he understandeth and knoweth me, that I am the Lord which exercise lovingkindness, judgment, and righteousness, in the earth: for in these things I delight, saith the Lord.",
                "NASB": "This is what the Lord says: “Let no wise man boast of his wisdom, nor let the mighty man boast of his might, nor a rich man boast of his riches; but let the one who boasts boast of this, that he understands and knows Me, that I am the Lord who exercises mercy, justice, and righteousness on the earth; for I delight in these things,” declares the Lord.",
                "NIV": "This is what the Lord says:<br><br>“Let not the wise boast of their wisdom<br>    or the strong boast of their strength<br>    or the rich boast of their riches,<br>but let the one who boasts boast about this:<br>    that they have the understanding to know me,<br>that I am the Lord, who exercises kindness,<br>    justice and righteousness on earth,<br>    for in these I delight,”<br>declares the Lord.",
                "NKJV": "Thus says the Lord:<br><br>“Let not the wise man glory in his wisdom,<br>Let not the mighty man glory in his might,<br>Nor let the rich man glory in his riches;<br>But let him who glories glory in this,<br>That he understands and knows Me,<br>That I am the Lord, exercising lovingkindness, judgment, and righteousness in the earth.<br>For in these I delight,” says the Lord."
            },
            {
                "reference": "Jeremiah 17:9-10",
                "ESV": "The heart is deceitful above all things,<br>    and desperately sick;<br>    who can understand it?<br>“I the Lord search the heart<br>    and test the mind,<br>to give every man according to his ways,<br>    according to the fruit of his deeds.”",
                "KJV": "The heart is deceitful above all things, and desperately wicked: who can know it?<br><br>I the Lord search the heart, I try the reins, even to give every man according to his ways, and according to the fruit of his doings.",
                "NASB": "“The heart is more deceitful than all else<br>And is desperately sick;<br>Who can understand it?<br>I, the Lord, search the heart,<br>I test the mind,<br>To give to each person according to his ways,<br>According to the results of his deeds.",
                "NIV": "The heart is deceitful above all things<br>    and beyond cure.<br>    Who can understand it?<br><br>“I the Lord search the heart<br>    and examine the mind,<br>to reward each person according to their conduct,<br>    according to what their deeds deserve.”",
                "NKJV": "“The heart is deceitful above all things,<br>And desperately wicked;<br>Who can know it?<br>I, the Lord, search the heart,<br>I test the mind,<br>Even to give every man according to his ways,<br>According to the fruit of his doings."
            },
            {
                "reference": "Jeremiah 29:11",
                "ESV": "For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope.",
                "KJV": "For I know the thoughts that I think toward you, saith the Lord, thoughts of peace, and not of evil, to give you an expected end.",
                "NASB": "For I know the plans that I have for you,’ declares the Lord, ‘plans for prosperity and not for disaster, to give you a future and a hope.",
                "NIV": "For I know the plans I have for you,” declares the Lord, “plans to prosper you and not to harm you, plans to give you hope and a future.",
                "NKJV": "For I know the thoughts that I think toward you, says the Lord, thoughts of peace and not of evil, to give you a future and a hope."
            },
            {
                "reference": "Jeremiah 31:31-34",
                "ESV": "“Behold, the days are coming, declares the Lord, when I will make a new covenant with the house of Israel and the house of Judah, not like the covenant that I made with their fathers on the day when I took them by the hand to bring them out of the land of Egypt, my covenant that they broke, though I was their husband, declares the Lord. For this is the covenant that I will make with the house of Israel after those days, declares the Lord: I will put my law within them, and I will write it on their hearts. And I will be their God, and they shall be my people. And no longer shall each one teach his neighbor and each his brother, saying, ‘Know the Lord,’ for they shall all know me, from the least of them to the greatest, declares the Lord. For I will forgive their iniquity, and I will remember their sin no more.”",
                "KJV": "Behold, the days come, saith the Lord, that I will make a new covenant with the house of Israel, and with the house of Judah:<br><br>Not according to the covenant that I made with their fathers in the day that I took them by the hand to bring them out of the land of Egypt; which my covenant they brake, although I was an husband unto them, saith the Lord:<br><br>But this shall be the covenant that I will make with the house of Israel; After those days, saith the Lord, I will put my law in their inward parts, and write it in their hearts; and will be their God, and they shall be my people.<br><br>And they shall teach no more every man his neighbour, and every man his brother, saying, Know the Lord: for they shall all know me, from the least of them unto the greatest of them, saith the Lord: for I will forgive their iniquity, and I will remember their sin no more.",
                "NASB": "“Behold, days are coming,” declares the Lord, “when I will make a new covenant with the house of Israel and the house of Judah, not like the covenant which I made with their fathers on the day I took them by the hand to bring them out of the land of Egypt, My covenant which they broke, although I was a husband to them,” declares the Lord. “For this is the covenant which I will make with the house of Israel after those days,” declares the Lord: “I will put My law within them and write it on their heart; and I will be their God, and they shall be My people. They will not teach again, each one his neighbor and each one his brother, saying, ‘Know the Lord,’ for they will all know Me, from the least of them to the greatest of them,” declares the Lord, “for I will forgive their wrongdoing, and their sin I will no longer remember.”",
                "NIV": "“The days are coming,” declares the Lord,<br>    “when I will make a new covenant<br>with the people of Israel<br>    and with the people of Judah.<br>It will not be like the covenant<br>    I made with their ancestors<br>when I took them by the hand<br>    to lead them out of Egypt,<br>because they broke my covenant,<br>    though I was a husband to them,”<br>declares the Lord.<br>“This is the covenant I will make with the people of Israel<br>    after that time,” declares the Lord.<br>“I will put my law in their minds<br>    and write it on their hearts.<br>I will be their God,<br>    and they will be my people.<br>No longer will they teach their neighbor,<br>    or say to one another, ‘Know the Lord,’<br>because they will all know me,<br>    from the least of them to the greatest,”<br>declares the Lord.<br>“For I will forgive their wickedness<br>    and will remember their sins no more.”",
                "NKJV": "“Behold, the days are coming, says the Lord, when I will make a new covenant with the house of Israel and with the house of Judah— not according to the covenant that I made with their fathers in the day that I took them by the hand to lead them out of the land of Egypt, My covenant which they broke, though I was a husband to them, says the Lord. But this is the covenant that I will make with the house of Israel after those days, says the Lord: I will put My law in their minds, and write it on their hearts; and I will be their God, and they shall be My people. No more shall every man teach his neighbor, and every man his brother, saying, ‘Know the Lord,’ for they all shall know Me, from the least of them to the greatest of them, says the Lord. For I will forgive their iniquity, and their sin I will remember no more.”"
            }
        ],
        "Lamentations": [
            {
                "reference": "Lamentations 3:21-23",
                "ESV": "But this I call to mind,<br>    and therefore I have hope:<br><br>The steadfast love of the Lord never ceases;<br>    his mercies never come to an end;<br>they are new every morning;<br>    great is your faithfulness.",
                "KJV": "This I recall to my mind, therefore have I hope.<br><br>It is of the Lord's mercies that we are not consumed, because his compassions fail not.<br><br>They are new every morning: great is thy faithfulness.",
                "NASB": "I recall this to my mind,<br>Therefore I wait.<br>The Lord’s acts of mercy indeed do not end,<br>For His compassions do not fail.<br>They are new every morning;<br>Great is Your faithfulness.",
                "NIV": "Yet this I call to mind<br>    and therefore I have hope:<br><br>Because of the Lord’s great love we are not consumed,<br>    for his compassions never fail.<br>They are new every morning;<br>    great is your faithfulness.",
                "NKJV": "This I recall to my mind,<br>Therefore I have hope.<br><br>Through the Lord’s mercies we are not consumed,<br>Because His compassions fail not.<br>They are new every morning;<br>Great is Your faithfulness."
            }
        ],
        "Ezekiel": [
            {
                "reference": "Ezekiel 18:31-32",
                "ESV": "Cast away from you all the transgressions that you have committed, and make yourselves a new heart and a new spirit! Why will you die, O house of Israel? For I have no pleasure in the death of anyone, declares the Lord God; so turn, and live.”",
                "KJV": "Cast away from you all your transgressions, whereby ye have transgressed; and make you a new heart and a new spirit: for why will ye die, O house of Israel?<br><br>For I have no pleasure in the death of him that dieth, saith the Lord God: wherefore turn yourselves, and live ye.",
                "NASB": "Hurl away from you all your offenses which you have committed and make yourselves a new heart and a new spirit! For why should you die, house of Israel? For I take no pleasure in the death of anyone who dies,” declares the Lord God. “Therefore, repent and live!”",
                "NIV": "Rid yourselves of all the offenses you have committed, and get a new heart and a new spirit. Why will you die, people of Israel? For I take no pleasure in the death of anyone, declares the Sovereign Lord. Repent and live!",
                "NKJV": "Cast away from you all the transgressions which you have committed, and get yourselves a new heart and a new spirit. For why should you die, O house of Israel? For I have no pleasure in the death of one who dies,” says the Lord God. “Therefore turn and live!”"
            },
            {
                "reference": "Ezekiel 36:26-27",
                "ESV": "And I will give you a new heart, and a new spirit I will put within you. And I will remove the heart of stone from your flesh and give you a heart of flesh. And I will put my Spirit within you, and cause you to walk in my statutes and be careful to obey my rules.",
                "KJV": "A new heart also will I give you, and a new spirit will I put within you: and I will take away the stony heart out of your flesh, and I will give you an heart of flesh.<br><br>And I will put my spirit within you, and cause you to walk in my statutes, and ye shall keep my judgments, and do them.",
                "NASB": "Moreover, I will give you a new heart and put a new spirit within you; and I will remove the heart of stone from your flesh and give you a heart of flesh. And I will put My Spirit within you and bring it about that you walk in My statutes, and are careful and follow My ordinances.",
                "NIV": "I will give you a new heart and put a new spirit in you; I will remove from you your heart of stone and give you a heart of flesh. And I will put my Spirit in you and move you to follow my decrees and be careful to keep my laws.",
                "NKJV": "I will give you a new heart and put a new spirit within you; I will take the heart of stone out of your flesh and give you a heart of flesh. I will put My Spirit within you and cause you to walk in My statutes, and you will keep My judgments and do them."
            }
        ],
        "Daniel": [
            {
                "reference": "Daniel 6:10",
                "ESV": "When Daniel knew that the document had been signed, he went to his house where he had windows in his upper chamber open toward Jerusalem. He got down on his knees three times a day and prayed and gave thanks before his God, as he had done previously.",
                "KJV": "Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber toward Jerusalem, he kneeled upon his knees three times a day, and prayed, and gave thanks before his God, as he did aforetime.",
                "NASB": "Now when Daniel learned that the document was signed, he entered his house (and in his roof chamber he had windows open toward Jerusalem); and he continued kneeling on his knees three times a day, praying and offering praise before his God, just as he had been doing previously.",
                "NIV": "Now when Daniel learned that the decree had been published, he went home to his upstairs room where the windows opened toward Jerusalem. Three times a day he got down on his knees and prayed, giving thanks to his God, just as he had done before.",
                "NKJV": "Now when Daniel knew that the writing was signed, he went home. And in his upper room, with his windows open toward Jerusalem, he knelt down on his knees three times that day, and prayed and gave thanks before his God, as was his custom since early days."
            }
        ],
        "Micah": [
            {
                "reference": "Micah 6:8",
                "ESV": "He has told you, O man, what is good;<br>    and what does the Lord require of you<br>but to do justice, and to love kindness,<br>    and to walk humbly with your God?",
                "KJV": "He hath shewed thee, O man, what is good; and what doth the Lord require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?",
                "NASB": "He has told you, mortal one, what is good;<br>And what does the Lord require of you<br>But to do justice, to love kindness,<br>And to walk humbly with your God?",
                "NIV": "He has shown you, O mortal, what is good.<br>    And what does the Lord require of you?<br>To act justly and to love mercy<br>    and to walk humbly with your God.",
                "NKJV": "He has shown you, O man, what is good;<br>And what does the Lord require of you<br>But to do justly,<br>To love mercy,<br>And to walk humbly with your God?"
            }
        ],
        "Malachi": [
            {
                "reference": "Malachi 3:10",
                "ESV": "Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the Lord of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need.",
                "KJV": "Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the Lord of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it.",
                "NASB": "Bring the whole tithe into the storehouse, so that there may be food in My house, and put Me to the test now in this,” says the Lord of armies, “if I do not open for you the windows of heaven and pour out for you a blessing until it overflows.",
                "NIV": "Bring the whole tithe into the storehouse, that there may be food in my house. Test me in this,” says the Lord Almighty, “and see if I will not throw open the floodgates of heaven and pour out so much blessing that there will not be room enough to store it.",
                "NKJV": "Bring all the tithes into the storehouse,<br>That there may be food in My house,<br>And try Me now in this,”<br>Says the Lord of hosts,<br>“If I will not open for you the windows of heaven<br>And pour out for you such blessing<br>That there will not be room enough to receive it."
            }
        ]
    },
    "New": {
        "Matthew": [
            {
                "reference": "Matthew 5:37",
                "ESV": "Let what you say be simply ‘Yes’ or ‘No’; anything more than this comes from evil.",
                "KJV": "But let your communication be, Yea, yea; Nay, nay: for whatsoever is more than these cometh of evil.",
                "NASB": "But make sure your statement is, ‘Yes, yes’ or ‘No, no’; anything beyond these is of evil origin.",
                "NIV": "All you need to say is simply ‘Yes’ or ‘No’; anything beyond this comes from the evil one.",
                "NKJV": "But let your ‘Yes’ be ‘Yes,’ and your ‘No,’ ‘No.’ For whatever is more than these is from the evil one."
            },
            {
                "reference": "Matthew 6:9-13",
                "ESV": "Pray then like this:<br><br>“Our Father in heaven,<br>hallowed be your name.<br>Your kingdom come,<br>your will be done,<br>    on earth as it is in heaven.<br>Give us this day our daily bread,<br>and forgive us our debts,<br>    as we also have forgiven our debtors.<br>And lead us not into temptation,<br>    but deliver us from evil.",
                "KJV": "After this manner therefore pray ye: Our Father which art in heaven, Hallowed be thy name.<br><br>Thy kingdom come, Thy will be done in earth, as it is in heaven.<br><br>Give us this day our daily bread.<br><br>And forgive us our debts, as we forgive our debtors.<br><br>And lead us not into temptation, but deliver us from evil: For thine is the kingdom, and the power, and the glory, for ever. Amen.",
                "NASB": "“Pray, then, in this way:<br><br>‘Our Father, who is in heaven,<br>Hallowed be Your name.<br>Your kingdom come.<br>Your will be done,<br>On earth as it is in heaven.<br>Give us this day our daily bread.<br>And forgive us our debts, as we also have forgiven our debtors.<br>And do not lead us into temptation, but deliver us from evil.’",
                "NIV": "“This, then, is how you should pray:<br><br>“‘Our Father in heaven,<br>hallowed be your name,<br>your kingdom come,<br>your will be done,<br>    on earth as it is in heaven.<br>Give us today our daily bread.<br>And forgive us our debts,<br>    as we also have forgiven our debtors.<br>And lead us not into temptation,<br>    but deliver us from the evil one.’",
                "NKJV": "In this manner, therefore, pray:<br><br>Our Father in heaven,<br>Hallowed be Your name.<br>Your kingdom come.<br>Your will be done<br>On earth as it is in heaven.<br>Give us this day our daily bread.<br>And forgive us our debts,<br>As we forgive our debtors.<br>And do not lead us into temptation,<br>But deliver us from the evil one.<br>For Yours is the kingdom and the power and the glory forever. Amen."
            },
            {
                "reference": "Matthew 6:33",
                "ESV": "But seek first the kingdom of God and his righteousness, and all these things will be added to you.",
                "KJV": "But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you.",
                "NASB": "But seek first His kingdom and His righteousness, and all these things will be provided to you.",
                "NIV": "But seek first his kingdom and his righteousness, and all these things will be given to you as well.",
                "NKJV": "But seek first the kingdom of God and His righteousness, and all these things shall be added to you."
            },
            {
                "reference": "Matthew 7:7-8",
                "ESV": "“Ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you. For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened.",
                "KJV": "Ask, and it shall be given you; seek, and ye shall find; knock, and it shall be opened unto you:<br><br>For every one that asketh receiveth; and he that seeketh findeth; and to him that knocketh it shall be opened.",
                "NASB": "“Ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you. For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened.",
                "NIV": "“Ask and it will be given to you; seek and you will find; knock and the door will be opened to you. For everyone who asks receives; the one who seeks finds; and to the one who knocks, the door will be opened.",
                "NKJV": "“Ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you. For everyone who asks receives, and he who seeks finds, and to him who knocks it will be opened."
            },
            {
                "reference": "Matthew 7:12",
                "ESV": "“So whatever you wish that others would do to you, do also to them, for this is the Law and the Prophets.",
                "KJV": "Therefore all things whatsoever ye would that men should do to you, do ye even so to them: for this is the law and the prophets.",
                "NASB": "“In everything, therefore, treat people the same way you want them to treat you, for this is the Law and the Prophets.",
                "NIV": "So in everything, do to others what you would have them do to you, for this sums up the Law and the Prophets.",
                "NKJV": "Therefore, whatever you want men to do to you, do also to them, for this is the Law and the Prophets."
            },
            {
                "reference": "Matthew 9:37-38",
                "ESV": "Then he said to his disciples, “The harvest is plentiful, but the laborers are few; therefore pray earnestly to the Lord of the harvest to send out laborers into his harvest.”",
                "KJV": "Then saith he unto his disciples, The harvest truly is plenteous, but the labourers are few;<br><br>Pray ye therefore the Lord of the harvest, that he will send forth labourers into his harvest.",
                "NASB": "Then He *said to His disciples, “The harvest is plentiful, but the workers are few. Therefore, plead with the Lord of the harvest to send out workers into His harvest.”",
                "NIV": "Then he said to his disciples, “The harvest is plentiful but the workers are few. Ask the Lord of the harvest, therefore, to send out workers into his harvest field.”",
                "NKJV": "Then He said to His disciples, “The harvest truly is plentiful, but the laborers are few. Therefore pray the Lord of the harvest to send out laborers into His harvest.”"
            },
            {
                "reference": "Matthew 10:19-20",
                "ESV": "When they deliver you over, do not be anxious how you are to speak or what you are to say, for what you are to say will be given to you in that hour. For it is not you who speak, but the Spirit of your Father speaking through you.",
                "KJV": "But when they deliver you up, take no thought how or what ye shall speak: for it shall be given you in that same hour what ye shall speak.<br><br>For it is not ye that speak, but the Spirit of your Father which speaketh in you.",
                "NASB": "But when they hand you over, do not worry about how or what you are to say; for what you are to say will be given you in that hour. For it is not you who are speaking, but it is the Spirit of your Father who is speaking in you.",
                "NIV": "But when they arrest you, do not worry about what to say or how to say it. At that time you will be given what to say, for it will not be you speaking, but the Spirit of your Father speaking through you.",
                "NKJV": "But when they deliver you up, do not worry about how or what you should speak. For it will be given to you in that hour what you should speak; for it is not you who speak, but the Spirit of your Father who speaks in you."
            },
            {
                "reference": "Matthew 18:20",
                "ESV": "For where two or three are gathered in my name, there am I among them.”",
                "KJV": "For where two or three are gathered together in my name, there am I in the midst of them.",
                "NASB": "For where two or three have gathered together in My name, I am there in their midst.”",
                "NIV": "For where two or three gather in my name, there am I with them.”",
                "NKJV": "For where two or three are gathered together in My name, I am there in the midst of them.”"
            },
            {
                "reference": "Matthew 19:26",
                "ESV": "But Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”",
                "KJV": "But Jesus beheld them, and said unto them, With men this is impossible; but with God all things are possible.",
                "NASB": "And looking at them, Jesus said to them, “With people this is impossible, but with God all things are possible.”",
                "NIV": "Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”",
                "NKJV": "But Jesus looked at them and said to them, “With men this is impossible, but with God all things are possible.”"
            },
            {
                "reference": "Matthew 28:18-20",
                "ESV": "And Jesus came and said to them, “All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all that I have commanded you. And behold, I am with you always, to the end of the age.”",
                "KJV": "And Jesus came and spake unto them, saying, All power is given unto me in heaven and in earth.<br><br>Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost:<br><br>Teaching them to observe all things whatsoever I have commanded you: and, lo, I am with you always, even unto the end of the world. Amen.",
                "NASB": "And Jesus came up and spoke to them, saying, “All authority in heaven and on earth has been given to Me. Go, therefore, and make disciples of all the nations, baptizing them in the name of the Father and the Son and the Holy Spirit, teaching them to follow all that I commanded you; and behold, I am with you always, to the end of the age.”",
                "NIV": "Then Jesus came to them and said, “All authority in heaven and on earth has been given to me. Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I am with you always, to the very end of the age.”",
                "NKJV": "And Jesus came and spoke to them, saying, “All authority has been given to Me in heaven and on earth. Go therefore and make disciples of all the nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching them to observe all things that I have commanded you; and lo, I am with you always, even to the end of the age.” Amen."
            }
        ],
        "Mark": [
            {
                "reference": "Mark 12:29-31",
                "ESV": "Jesus answered, “The most important is, ‘Hear, O Israel: The Lord our God, the Lord is one. And you shall love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’ The second is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.”",
                "KJV": "And Jesus answered him, The first of all the commandments is, Hear, O Israel; The Lord our God is one Lord:<br><br>And thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind, and with all thy strength: this is the first commandment.<br><br>And the second is like, namely this, Thou shalt love thy neighbour as thyself. There is none other commandment greater than these.",
                "NASB": "Jesus answered, “The foremost is, ‘Hear, Israel! The Lord is our God, the Lord is one; and you shall love the Lord your God with all your heart, and with all your soul, and with all your mind, and with all your strength.’ The second is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.”",
                "NIV": "“The most important one,” answered Jesus, “is this: ‘Hear, O Israel: The Lord our God, the Lord is one. Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’ The second is this: ‘Love your neighbor as yourself.’ There is no commandment greater than these.”",
                "NKJV": "Jesus answered him, “The first of all the commandments is: ‘Hear, O Israel, the Lord our God, the Lord is one. And you shall love the Lord your God with all your heart, with all your soul, with all your mind, and with all your strength.’ This is the first commandment. And the second, like it, is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.”"
            }
        ],
        "Luke": [
            {
                "reference": "Luke 2:52",
                "ESV": "And Jesus increased in wisdom and in stature and in favor with God and man.",
                "KJV": "And Jesus increased in wisdom and stature, and in favour with God and man.",
                "NASB": "And Jesus kept increasing in wisdom and stature, and in favor with God and people.",
                "NIV": "And Jesus grew in wisdom and stature, and in favor with God and man.",
                "NKJV": "And Jesus increased in wisdom and stature, and in favor with God and men."
            },
            {
                "reference": "Luke 6:38",
                "ESV": "give, and it will be given to you. Good measure, pressed down, shaken together, running over, will be put into your lap. For with the measure you use it will be measured back to you.”",
                "KJV": "Give, and it shall be given unto you; good measure, pressed down, and shaken together, and running over, shall men give into your bosom. For with the same measure that ye mete withal it shall be measured to you again.",
                "NASB": "Give, and it will be given to you. They will pour into your lap a good measure—pressed down, shaken together, and running over. For by your standard of measure it will be measured to you in return.”",
                "NIV": "Give, and it will be given to you. A good measure, pressed down, shaken together and running over, will be poured into your lap. For with the measure you use, it will be measured to you.”",
                "NKJV": "Give, and it will be given to you: good measure, pressed down, shaken together, and running over will be put into your bosom. For with the same measure that you use, it will be measured back to you.”"
            }
        ],
        "John": [
            {
                "reference": "John 1:1",
                "ESV": "In the beginning was the Word, and the Word was with God, and the Word was God.",
                "KJV": "In the beginning was the Word, and the Word was with God, and the Word was God.",
                "NASB": "In the beginning was the Word, and the Word was with God, and the Word was God.",
                "NIV": "In the beginning was the Word, and the Word was with God, and the Word was God.",
                "NKJV": "In the beginning was the Word, and the Word was with God, and the Word was God."
            },
            {
                "reference": "John 1:14",
                "ESV": "And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father, full of grace and truth.",
                "KJV": "And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.",
                "NASB": "And the Word became flesh, and dwelt among us; and we saw His glory, glory as of the only Son from the Father, full of grace and truth.",
                "NIV": "The Word became flesh and made his dwelling among us. We have seen his glory, the glory of the one and only Son, who came from the Father, full of grace and truth.",
                "NKJV": "And the Word became flesh and dwelt among us, and we beheld His glory, the glory as of the only begotten of the Father, full of grace and truth."
            },
            {
                "reference": "John 3:16-17",
                "ESV": "“For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life. For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him.",
                "KJV": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.<br><br>For God sent not his Son into the world to condemn the world; but that the world through him might be saved.",
                "NASB": "“For God so loved the world, that He gave His only Son, so that everyone who believes in Him will not perish, but have eternal life. For God did not send the Son into the world to judge the world, but so that the world might be saved through Him.",
                "NIV": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life. For God did not send his Son into the world to condemn the world, but to save the world through him.",
                "NKJV": "For God so loved the world that He gave His only begotten Son, that whoever believes in Him should not perish but have everlasting life. For God did not send His Son into the world to condemn the world, but that the world through Him might be saved."
            },
            {
                "reference": "John 4:23-24",
                "ESV": "But the hour is coming, and is now here, when the true worshipers will worship the Father in spirit and truth, for the Father is seeking such people to worship him. God is spirit, and those who worship him must worship in spirit and truth.”",
                "KJV": "But the hour cometh, and now is, when the true worshippers shall worship the Father in spirit and in truth: for the Father seeketh such to worship him.<br><br>God is a Spirit: and they that worship him must worship him in spirit and in truth.",
                "NASB": "But a time is coming, and even now has arrived, when the true worshipers will worship the Father in spirit and truth; for such people the Father seeks to be His worshipers. God is spirit, and those who worship Him must worship in spirit and truth.”",
                "NIV": "Yet a time is coming and has now come when the true worshipers will worship the Father in the Spirit and in truth, for they are the kind of worshipers the Father seeks. God is spirit, and his worshipers must worship in the Spirit and in truth.”",
                "NKJV": "But the hour is coming, and now is, when the true worshipers will worship the Father in spirit and truth; for the Father is seeking such to worship Him. God is Spirit, and those who worship Him must worship in spirit and truth.”"
            },
            {
                "reference": "John 6:44",
                "ESV": "No one can come to me unless the Father who sent me draws him. And I will raise him up on the last day.",
                "KJV": "No man can come to me, except the Father which hath sent me draw him: and I will raise him up at the last day.",
                "NASB": "No one can come to Me unless the Father who sent Me draws him; and I will raise him up on the last day.",
                "NIV": "“No one can come to me unless the Father who sent me draws them, and I will raise them up at the last day.",
                "NKJV": "No one can come to Me unless the Father who sent Me draws him; and I will raise him up at the last day."
            },
            {
                "reference": "John 13:34-35",
                "ESV": "A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another. By this all people will know that you are my disciples, if you have love for one another.”",
                "KJV": "A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another.<br><br>By this shall all men know that ye are my disciples, if ye have love one to another.",
                "NASB": "I am giving you a new commandment, that you love one another; just as I have loved you, that you also love one another. By this all people will know that you are My disciples: if you have love for one another.”",
                "NIV": "“A new command I give you: Love one another. As I have loved you, so you must love one another. By this everyone will know that you are my disciples, if you love one another.”",
                "NKJV": "A new commandment I give to you, that you love one another; as I have loved you, that you also love one another. By this all will know that you are My disciples, if you have love for one another.”"
            },
            {
                "reference": "John 14:6",
                "ESV": "Jesus said to him, “I am the way, and the truth, and the life. No one comes to the Father except through me.",
                "KJV": "Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.",
                "NASB": "Jesus *said to him, “I am the way, and the truth, and the life; no one comes to the Father except through Me.",
                "NIV": "Jesus answered, “I am the way and the truth and the life. No one comes to the Father except through me.",
                "NKJV": "Jesus said to him, “I am the way, the truth, and the life. No one comes to the Father except through Me."
            },
            {
                "reference": "John 17:3",
                "ESV": "And this is eternal life, that they know you, the only true God, and Jesus Christ whom you have sent.",
                "KJV": "And this is life eternal, that they might know thee the only true God, and Jesus Christ, whom thou hast sent.",
                "NASB": "And this is eternal life, that they may know You, the only true God, and Jesus Christ whom You have sent.",
                "NIV": "Now this is eternal life: that they know you, the only true God, and Jesus Christ, whom you have sent.",
                "NKJV": "And this is eternal life, that they may know You, the only true God, and Jesus Christ whom You have sent."
            }
        ],
        "Acts": [
            {
                "reference": "Acts 1:8",
                "ESV": "But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the end of the earth.”",
                "KJV": "But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, and unto the uttermost part of the earth.",
                "NASB": "but you will receive power when the Holy Spirit has come upon you; and you shall be My witnesses both in Jerusalem and in all Judea, and Samaria, and as far as the remotest part of the earth.”",
                "NIV": "But you will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth.”",
                "NKJV": "But you shall receive power when the Holy Spirit has come upon you; and you shall be witnesses to Me in Jerusalem, and in all Judea and Samaria, and to the end of the earth.”"
            },
            {
                "reference": "Acts 2:42-47",
                "ESV": "And they devoted themselves to the apostles' teaching and the fellowship, to the breaking of bread and the prayers. And awe came upon every soul, and many wonders and signs were being done through the apostles. And all who believed were together and had all things in common. And they were selling their possessions and belongings and distributing the proceeds to all, as any had need. And day by day, attending the temple together and breaking bread in their homes, they received their food with glad and generous hearts, praising God and having favor with all the people. And the Lord added to their number day by day those who were being saved.",
                "KJV": "And they continued stedfastly in the apostles' doctrine and fellowship, and in breaking of bread, and in prayers.<br><br>And fear came upon every soul: and many wonders and signs were done by the apostles.<br><br>And all that believed were together, and had all things common;<br><br>And sold their possessions and goods, and parted them to all men, as every man had need.<br><br>And they, continuing daily with one accord in the temple, and breaking bread from house to house, did eat their meat with gladness and singleness of heart,<br><br>Praising God, and having favour with all the people. And the Lord added to the church daily such as should be saved.",
                "NASB": "They were continually devoting themselves to the apostles’ teaching and to fellowship, to the breaking of bread and to prayer.<br><br>Everyone kept feeling a sense of awe; and many wonders and signs were taking place through the apostles. And all the believers were together and had all things in common; and they would sell their property and possessions and share them with all, to the extent that anyone had need. Day by day continuing with one mind in the temple, and breaking bread from house to house, they were taking their meals together with gladness and sincerity of heart, praising God and having favor with all the people. And the Lord was adding to their number day by day those who were being saved.",
                "NIV": "They devoted themselves to the apostles’ teaching and to fellowship, to the breaking of bread and to prayer. Everyone was filled with awe at the many wonders and signs performed by the apostles. All the believers were together and had everything in common. They sold property and possessions to give to anyone who had need. Every day they continued to meet together in the temple courts. They broke bread in their homes and ate together with glad and sincere hearts, praising God and enjoying the favor of all the people. And the Lord added to their number daily those who were being saved.",
                "NKJV": "And they continued steadfastly in the apostles’ doctrine and fellowship, in the breaking of bread, and in prayers. Then fear came upon every soul, and many wonders and signs were done through the apostles. Now all who believed were together, and had all things in common, and sold their possessions and goods, and divided them among all, as anyone had need.<br><br>So continuing daily with one accord in the temple, and breaking bread from house to house, they ate their food with gladness and simplicity of heart, praising God and having favor with all the people. And the Lord added to the church daily those who were being saved."
            },
            {
                "reference": "Acts 4:12",
                "ESV": "And there is salvation in no one else, for there is no other name under heaven given among men by which we must be saved.”",
                "KJV": "Neither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved.",
                "NASB": "And there is salvation in no one else; for there is no other name under heaven that has been given among mankind by which we must be saved.”",
                "NIV": "Salvation is found in no one else, for there is no other name under heaven given to mankind by which we must be saved.”",
                "NKJV": "Nor is there salvation in any other, for there is no other name under heaven given among men by which we must be saved.”"
            },
            {
                "reference": "Acts 5:41-42",
                "ESV": "Then they left the presence of the council, rejoicing that they were counted worthy to suffer dishonor for the name. And every day, in the temple and from house to house, they did not cease teaching and preaching that the Christ is Jesus.",
                "KJV": "And they departed from the presence of the council, rejoicing that they were counted worthy to suffer shame for his name.<br><br>And daily in the temple, and in every house, they ceased not to teach and preach Jesus Christ.",
                "NASB": "So they went on their way from the presence of the Council, rejoicing that they had been considered worthy to suffer shame for His name. And every day, in the temple and from house to house, they did not stop teaching and preaching the good news of Jesus as the Christ.",
                "NIV": "The apostles left the Sanhedrin, rejoicing because they had been counted worthy of suffering disgrace for the Name. Day after day, in the temple courts and from house to house, they never stopped teaching and proclaiming the good news that Jesus is the Messiah.",
                "NKJV": "So they departed from the presence of the council, rejoicing that they were counted worthy to suffer shame for His name. And daily in the temple, and in every house, they did not cease teaching and preaching Jesus as the Christ."
            },
            {
                "reference": "Acts 13:48",
                "ESV": "And when the Gentiles heard this, they began rejoicing and glorifying the word of the Lord, and as many as were appointed to eternal life believed.",
                "KJV": "And when the Gentiles heard this, they were glad, and glorified the word of the Lord: and as many as were ordained to eternal life believed.",
                "NASB": "When the Gentiles heard this, they began rejoicing and glorifying the word of the Lord; and all who had been appointed to eternal life believed.",
                "NIV": "When the Gentiles heard this, they were glad and honored the word of the Lord; and all who were appointed for eternal life believed.",
                "NKJV": "Now when the Gentiles heard this, they were glad and glorified the word of the Lord. And as many as had been appointed to eternal life believed."
            }
        ],
        "Romans": [
            {
                "reference": "Romans 1:16-17",
                "ESV": "For I am not ashamed of the gospel, for it is the power of God for salvation to everyone who believes, to the Jew first and also to the Greek. For in it the righteousness of God is revealed from faith for faith, as it is written, “The righteous shall live by faith.”",
                "KJV": "For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek.<br><br>For therein is the righteousness of God revealed from faith to faith: as it is written, The just shall live by faith.",
                "NASB": "For I am not ashamed of the gospel, for it is the power of God for salvation to everyone who believes, to the Jew first and also to the Greek. For in it the righteousness of God is revealed from faith to faith; as it is written: “But the righteous one will live by faith.”",
                "NIV": "For I am not ashamed of the gospel, because it is the power of God that brings salvation to everyone who believes: first to the Jew, then to the Gentile. For in the gospel the righteousness of God is revealed—a righteousness that is by faith from first to last, just as it is written: “The righteous will live by faith.”",
                "NKJV": "For I am not ashamed of the gospel of Christ, for it is the power of God to salvation for everyone who believes, for the Jew first and also for the Greek. For in it the righteousness of God is revealed from faith to faith; as it is written, “The just shall live by faith.”"
            },
            {
                "reference": "Romans 1:18-20",
                "ESV": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who by their unrighteousness suppress the truth. For what can be known about God is plain to them, because God has shown it to them. For his invisible attributes, namely, his eternal power and divine nature, have been clearly perceived, ever since the creation of the world, in the things that have been made. So they are without excuse.",
                "KJV": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness;<br><br>Because that which may be known of God is manifest in them; for God hath shewed it unto them.<br><br>For the invisible things of him from the creation of the world are clearly seen, being understood by the things that are made, even his eternal power and Godhead; so that they are without excuse:",
                "NASB": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of people who suppress the truth in unrighteousness, because that which is known about God is evident within them; for God made it evident to them. For since the creation of the world His invisible attributes, that is, His eternal power and divine nature, have been clearly perceived, being understood by what has been made, so that they are without excuse.",
                "NIV": "The wrath of God is being revealed from heaven against all the godlessness and wickedness of people, who suppress the truth by their wickedness, since what may be known about God is plain to them, because God has made it plain to them. For since the creation of the world God’s invisible qualities—his eternal power and divine nature—have been clearly seen, being understood from what has been made, so that people are without excuse.",
                "NKJV": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who suppress the truth in unrighteousness, because what may be known of God is manifest in them, for God has shown it to them. For since the creation of the world His invisible attributes are clearly seen, being understood by the things that are made, even His eternal power and Godhead, so that they are without excuse,"
            },
            {
                "reference": "Romans 3:10",
                "ESV": "as it is written:<br><br>“None is righteous, no, not one;",
                "KJV": "As it is written, There is none righteous, no, not one:",
                "NASB": "as it is written:<br><br>“There is no righteous person, not even one;",
                "NIV": "As it is written:<br><br>“There is no one righteous, not even one;",
                "NKJV": "As it is written:<br><br>“There is none righteous, no, not one;"
            },
            {
                "reference": "Romans 3:23",
                "ESV": "for all have sinned and fall short of the glory of God,",
                "KJV": "For all have sinned, and come short of the glory of God;",
                "NASB": "for all have sinned and fall short of the glory of God,",
                "NIV": "for all have sinned and fall short of the glory of God,",
                "NKJV": "for all have sinned and fall short of the glory of God,"
            },
            {
                "reference": "Romans 5:8",
                "ESV": "but God shows his love for us in that while we were still sinners, Christ died for us.",
                "KJV": "But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.",
                "NASB": "But God demonstrates His own love toward us, in that while we were still sinners, Christ died for us.",
                "NIV": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us.",
                "NKJV": "But God demonstrates His own love toward us, in that while we were still sinners, Christ died for us."
            },
            {
                "reference": "Romans 5:17",
                "ESV": "For if, because of one man's trespass, death reigned through that one man, much more will those who receive the abundance of grace and the free gift of righteousness reign in life through the one man Jesus Christ.",
                "KJV": "For if by one man's offence death reigned by one; much more they which receive abundance of grace and of the gift of righteousness shall reign in life by one, Jesus Christ.)",
                "NASB": "For if by the offense of the one, death reigned through the one, much more will those who receive the abundance of grace and of the gift of righteousness reign in life through the One, Jesus Christ.",
                "NIV": "For if, by the trespass of the one man, death reigned through that one man, how much more will those who receive God’s abundant provision of grace and of the gift of righteousness reign in life through the one man, Jesus Christ!",
                "NKJV": "For if by the one man’s offense death reigned through the one, much more those who receive abundance of grace and of the gift of righteousness will reign in life through the One, Jesus Christ.)"
            },
            {
                "reference": "Romans 6:23",
                "ESV": "For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.",
                "KJV": "For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.",
                "NASB": "For the wages of sin is death, but the gracious gift of God is eternal life in Christ Jesus our Lord.",
                "NIV": "For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.",
                "NKJV": "For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord."
            },
            {
                "reference": "Romans 8:1",
                "ESV": "There is therefore now no condemnation for those who are in Christ Jesus.",
                "KJV": "There is therefore now no condemnation to them which are in Christ Jesus, who walk not after the flesh, but after the Spirit.",
                "NASB": "Therefore there is now no condemnation at all for those who are in Christ Jesus.",
                "NIV": "Therefore, there is now no condemnation for those who are in Christ Jesus,",
                "NKJV": "There is therefore now no condemnation to those who are in Christ Jesus, who do not walk according to the flesh, but according to the Spirit."
            },
            {
                "reference": "Romans 8:13",
                "ESV": "For if you live according to the flesh you will die, but if by the Spirit you put to death the deeds of the body, you will live.",
                "KJV": "For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.",
                "NASB": "for if you are living in accord with the flesh, you are going to die; but if by the Spirit you are putting to death the deeds of the body, you will live.",
                "NIV": "For if you live according to the flesh, you will die; but if by the Spirit you put to death the misdeeds of the body, you will live.",
                "NKJV": "For if you live according to the flesh you will die; but if by the Spirit you put to death the deeds of the body, you will live."
            },
            {
                "reference": "Romans 8:22-23",
                "ESV": "For we know that the whole creation has been groaning together in the pains of childbirth until now. And not only the creation, but we ourselves, who have the firstfruits of the Spirit, groan inwardly as we wait eagerly for adoption as sons, the redemption of our bodies.",
                "KJV": "For we know that the whole creation groaneth and travaileth in pain together until now.<br><br>And not only they, but ourselves also, which have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body.",
                "NASB": "For we know that the whole creation groans and suffers the pains of childbirth together until now. And not only that, but also we ourselves, having the first fruits of the Spirit, even we ourselves groan within ourselves, waiting eagerly for our adoption as sons and daughters, the redemption of our body.",
                "NIV": "We know that the whole creation has been groaning as in the pains of childbirth right up to the present time. Not only so, but we ourselves, who have the firstfruits of the Spirit, groan inwardly as we wait eagerly for our adoption to sonship, the redemption of our bodies.",
                "NKJV": "For we know that the whole creation groans and labors with birth pangs together until now. Not only that, but we also who have the firstfruits of the Spirit, even we ourselves groan within ourselves, eagerly waiting for the adoption, the redemption of our body."
            },
            {
                "reference": "Romans 8:26",
                "ESV": "Likewise the Spirit helps us in our weakness. For we do not know what to pray for as we ought, but the Spirit himself intercedes for us with groanings too deep for words.",
                "KJV": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered.",
                "NASB": "Now in the same way the Spirit also helps our weakness; for we do not know what to pray for as we should, but the Spirit Himself intercedes for us with groanings too deep for words;",
                "NIV": "In the same way, the Spirit helps us in our weakness. We do not know what we ought to pray for, but the Spirit himself intercedes for us through wordless groans.",
                "NKJV": "Likewise the Spirit also helps in our weaknesses. For we do not know what we should pray for as we ought, but the Spirit Himself makes intercession for us with groanings which cannot be uttered."
            },
            {
                "reference": "Romans 8:28",
                "ESV": "And we know that for those who love God all things work together for good, for those who are called according to his purpose.",
                "KJV": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.",
                "NASB": "And we know that God causes all things to work together for good to those who love God, to those who are called according to His purpose.",
                "NIV": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose.",
                "NKJV": "And we know that all things work together for good to those who love God, to those who are the called according to His purpose."
            },
            {
                "reference": "Romans 8:37-39",
                "ESV": "No, in all these things we are more than conquerors through him who loved us. For I am sure that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord.",
                "KJV": "Nay, in all these things we are more than conquerors through him that loved us.<br><br>For I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come,<br><br>Nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord.",
                "NASB": "But in all these things we overwhelmingly conquer through Him who loved us. For I am convinced that neither death, nor life, nor angels, nor principalities, nor things present, nor things to come, nor powers, nor height, nor depth, nor any other created thing will be able to separate us from the love of God that is in Christ Jesus our Lord.",
                "NIV": "No, in all these things we are more than conquerors through him who loved us. For I am convinced that neither death nor life, neither angels nor demons, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.",
                "NKJV": "Yet in all these things we are more than conquerors through Him who loved us. For I am persuaded that neither death nor life, nor angels nor principalities nor powers, nor things present nor things to come, nor height nor depth, nor any other created thing, shall be able to separate us from the love of God which is in Christ Jesus our Lord."
            },
            {
                "reference": "Romans 9:14-26",
                "ESV": "What shall we say then? Is there injustice on God's part? By no means! For he says to Moses, “I will have mercy on whom I have mercy, and I will have compassion on whom I have compassion.” So then it depends not on human will or exertion, but on God, who has mercy. For the Scripture says to Pharaoh, “For this very purpose I have raised you up, that I might show my power in you, and that my name might be proclaimed in all the earth.” So then he has mercy on whomever he wills, and he hardens whomever he wills.<br><br>You will say to me then, “Why does he still find fault? For who can resist his will?” But who are you, O man, to answer back to God? Will what is molded say to its molder, “Why have you made me like this?” Has the potter no right over the clay, to make out of the same lump one vessel for honorable use and another for dishonorable use? What if God, desiring to show his wrath and to make known his power, has endured with much patience vessels of wrath prepared for destruction, in order to make known the riches of his glory for vessels of mercy, which he has prepared beforehand for glory— even us whom he has called, not from the Jews only but also from the Gentiles? As indeed he says in Hosea,<br><br>“Those who were not my people I will call ‘my people,’<br>    and her who was not beloved I will call ‘beloved.’”<br>“And in the very place where it was said to them, ‘You are not my people,’<br>    there they will be called ‘sons of the living God.’”",
                "KJV": "What shall we say then? Is there unrighteousness with God? God forbid.<br><br>For he saith to Moses, I will have mercy on whom I will have mercy, and I will have compassion on whom I will have compassion.<br><br>So then it is not of him that willeth, nor of him that runneth, but of God that sheweth mercy.<br><br>For the scripture saith unto Pharaoh, Even for this same purpose have I raised thee up, that I might shew my power in thee, and that my name might be declared throughout all the earth.<br><br>Therefore hath he mercy on whom he will have mercy, and whom he will he hardeneth.<br><br>Thou wilt say then unto me, Why doth he yet find fault? For who hath resisted his will?<br><br>Nay but, O man, who art thou that repliest against God? Shall the thing formed say to him that formed it, Why hast thou made me thus?<br><br>Hath not the potter power over the clay, of the same lump to make one vessel unto honour, and another unto dishonour?<br><br>What if God, willing to shew his wrath, and to make his power known, endured with much longsuffering the vessels of wrath fitted to destruction:<br><br>And that he might make known the riches of his glory on the vessels of mercy, which he had afore prepared unto glory,<br><br>Even us, whom he hath called, not of the Jews only, but also of the Gentiles?<br><br>As he saith also in Osee, I will call them my people, which were not my people; and her beloved, which was not beloved.<br><br>And it shall come to pass, that in the place where it was said unto them, Ye are not my people; there shall they be called the children of the living God.",
                "NASB": "What shall we say then? There is no injustice with God, is there? Far from it! For He says to Moses, “I will have mercy on whomever I have mercy, and I will show compassion to whomever I show compassion.” So then, it does not depend on the person who wants it nor the one who runs, but on God who has mercy. For the Scripture says to Pharaoh, “For this very reason I raised you up, in order to demonstrate My power in you, and that My name might be proclaimed throughout the earth.” So then He has mercy on whom He desires, and He hardens whom He desires.<br><br>You will say to me then, “Why does He still find fault? For who has resisted His will?” On the contrary, who are you, you foolish person, who answers back to God? The thing molded will not say to the molder, “Why did you make me like this,” will it? Or does the potter not have a right over the clay, to make from the same lump one object for honorable use, and another for common use? What if God, although willing to demonstrate His wrath and to make His power known, endured with great patience objects of wrath prepared for destruction? And He did so to make known the riches of His glory upon objects of mercy, which He prepared beforehand for glory, namely us, whom He also called, not only from among Jews, but also from among Gentiles, as He also says in Hosea:<br><br>“I will call those who were not My people, ‘My people,’<br>And her who was not beloved, ‘beloved.’”<br>“And it shall be that in the place where it was said to them, ‘you are not My people,’<br>There they shall be called sons of the living God.”",
                "NIV": "What then shall we say? Is God unjust? Not at all! For he says to Moses,<br><br>“I will have mercy on whom I have mercy,<br>    and I will have compassion on whom I have compassion.”<br><br>It does not, therefore, depend on human desire or effort, but on God’s mercy. For Scripture says to Pharaoh: “I raised you up for this very purpose, that I might display my power in you and that my name might be proclaimed in all the earth.” Therefore God has mercy on whom he wants to have mercy, and he hardens whom he wants to harden.<br><br>One of you will say to me: “Then why does God still blame us? For who is able to resist his will?” But who are you, a human being, to talk back to God? “Shall what is formed say to the one who formed it, ‘Why did you make me like this?’” Does not the potter have the right to make out of the same lump of clay some pottery for special purposes and some for common use?<br><br>What if God, although choosing to show his wrath and make his power known, bore with great patience the objects of his wrath—prepared for destruction? What if he did this to make the riches of his glory known to the objects of his mercy, whom he prepared in advance for glory— even us, whom he also called, not only from the Jews but also from the Gentiles? As he says in Hosea:<br><br>“I will call them ‘my people’ who are not my people;<br>    and I will call her ‘my loved one’ who is not my loved one,”<br><br>and,<br><br>“In the very place where it was said to them,<br>    ‘You are not my people,’<br>    there they will be called ‘children of the living God.’”",
                "NKJV": "What shall we say then? Is there unrighteousness with God? Certainly not! For He says to Moses, “I will have mercy on whomever I will have mercy, and I will have compassion on whomever I will have compassion.” So then it is not of him who wills, nor of him who runs, but of God who shows mercy. For the Scripture says to the Pharaoh, “For this very purpose I have raised you up, that I may show My power in you, and that My name may be declared in all the earth.” Therefore He has mercy on whom He wills, and whom He wills He hardens.<br><br>You will say to me then, “Why does He still find fault? For who has resisted His will?” But indeed, O man, who are you to reply against God? Will the thing formed say to him who formed it, “Why have you made me like this?” Does not the potter have power over the clay, from the same lump to make one vessel for honor and another for dishonor?<br><br>What if God, wanting to show His wrath and to make His power known, endured with much longsuffering the vessels of wrath prepared for destruction, and that He might make known the riches of His glory on the vessels of mercy, which He had prepared beforehand for glory, even us whom He called, not of the Jews only, but also of the Gentiles?<br><br>As He says also in Hosea:<br><br>“I will call them My people, who were not My people,<br>And her beloved, who was not beloved.”<br>“And it shall come to pass in the place where it was said to them,<br>‘You are not My people,’<br>There they shall be called sons of the living God.”"
            },
            {
                "reference": "Romans 10:4",
                "ESV": "For Christ is the end of the law for righteousness to everyone who believes.",
                "KJV": "For Christ is the end of the law for righteousness to every one that believeth.",
                "NASB": "For Christ is the end of the Law for righteousness to everyone who believes.",
                "NIV": "Christ is the culmination of the law so that there may be righteousness for everyone who believes.",
                "NKJV": "For Christ is the end of the law for righteousness to everyone who believes."
            },
            {
                "reference": "Romans 10:9-10",
                "ESV": "because, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. For with the heart one believes and is justified, and with the mouth one confesses and is saved.",
                "KJV": "That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.<br><br>For with the heart man believeth unto righteousness; and with the mouth confession is made unto salvation.",
                "NASB": "that if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved; for with the heart a person believes, resulting in righteousness, and with the mouth he confesses, resulting in salvation.",
                "NIV": "If you declare with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you profess your faith and are saved.",
                "NKJV": "that if you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead, you will be saved. For with the heart one believes unto righteousness, and with the mouth confession is made unto salvation."
            },
            {
                "reference": "Romans 11:33-36",
                "ESV": "Oh, the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how inscrutable his ways!<br><br>“For who has known the mind of the Lord,<br>    or who has been his counselor?”<br>“Or who has given a gift to him<br>    that he might be repaid?”<br><br>For from him and through him and to him are all things. To him be glory forever. Amen.",
                "KJV": "O the depth of the riches both of the wisdom and knowledge of God! how unsearchable are his judgments, and his ways past finding out!<br><br>For who hath known the mind of the Lord? or who hath been his counsellor?<br><br>Or who hath first given to him, and it shall be recompensed unto him again?<br><br>For of him, and through him, and to him, are all things: to whom be glory for ever. Amen.",
                "NASB": "Oh, the depth of the riches, both of the wisdom and knowledge of God! How unsearchable are His judgments and unfathomable His ways! For who has known the mind of the Lord, or who became His counselor? Or who has first given to Him, that it would be paid back to him? For from Him, and through Him, and to Him are all things. To Him be the glory forever. Amen.",
                "NIV": "Oh, the depth of the riches of the wisdom and knowledge of God!<br>    How unsearchable his judgments,<br>    and his paths beyond tracing out!<br>“Who has known the mind of the Lord?<br>    Or who has been his counselor?”<br>“Who has ever given to God,<br>    that God should repay them?”<br>For from him and through him and for him are all things.<br>    To him be the glory forever! Amen.",
                "NKJV": "Oh, the depth of the riches both of the wisdom and knowledge of God! How unsearchable are His judgments and His ways past finding out!<br><br>“For who has known the mind of the Lord?<br>Or who has become His counselor?”<br>“Or who has first given to Him<br>And it shall be repaid to him?”<br><br>For of Him and through Him and to Him are all things, to whom be glory forever. Amen."
            },
            {
                "reference": "Romans 12:1-2",
                "ESV": "I appeal to you therefore, brothers, by the mercies of God, to present your bodies as a living sacrifice, holy and acceptable to God, which is your spiritual worship. Do not be conformed to this world, but be transformed by the renewal of your mind, that by testing you may discern what is the will of God, what is good and acceptable and perfect.",
                "KJV": "I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service.<br><br>And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.",
                "NASB": "Therefore I urge you, brothers and sisters, by the mercies of God, to present your bodies as a living and holy sacrifice, acceptable to God, which is your spiritual service of worship. And do not be conformed to this world, but be transformed by the renewing of your mind, so that you may prove what the will of God is, that which is good and acceptable and perfect.",
                "NIV": "Therefore, I urge you, brothers and sisters, in view of God’s mercy, to offer your bodies as a living sacrifice, holy and pleasing to God—this is your true and proper worship. Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God’s will is—his good, pleasing and perfect will.",
                "NKJV": "I beseech you therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice, holy, acceptable to God, which is your reasonable service. And do not be conformed to this world, but be transformed by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God."
            },
            {
                "reference": "Romans 14:22-23",
                "ESV": "The faith that you have, keep between yourself and God. Blessed is the one who has no reason to pass judgment on himself for what he approves. But whoever has doubts is condemned if he eats, because the eating is not from faith. For whatever does not proceed from faith is sin.",
                "KJV": "Hast thou faith? have it to thyself before God. Happy is he that condemneth not himself in that thing which he alloweth.<br><br>And he that doubteth is damned if he eat, because he eateth not of faith: for whatsoever is not of faith is sin.",
                "NASB": "The faith which you have, have as your own conviction before God. Happy is the one who does not condemn himself in what he approves. But the one who doubts is condemned if he eats, because his eating is not from faith; and whatever is not from faith is sin.",
                "NIV": "So whatever you believe about these things keep between yourself and God. Blessed is the one who does not condemn himself by what he approves. But whoever has doubts is condemned if they eat, because their eating is not from faith; and everything that does not come from faith is sin.",
                "NKJV": "Do you have faith? Have it to yourself before God. Happy is he who does not condemn himself in what he approves. But he who doubts is condemned if he eats, because he does not eat from faith; for whatever is not from faith is sin."
            }
        ],
        "1 Corinthians": [
            {
                "reference": "1 Corinthians 3:5-9",
                "ESV": "What then is Apollos? What is Paul? Servants through whom you believed, as the Lord assigned to each. I planted, Apollos watered, but God gave the growth. So neither he who plants nor he who waters is anything, but only God who gives the growth. He who plants and he who waters are one, and each will receive his wages according to his labor. For we are God's fellow workers. You are God's field, God's building.",
                "KJV": "Who then is Paul, and who is Apollos, but ministers by whom ye believed, even as the Lord gave to every man?<br><br>I have planted, Apollos watered; but God gave the increase.<br><br>So then neither is he that planteth any thing, neither he that watereth; but God that giveth the increase.<br><br>Now he that planteth and he that watereth are one: and every man shall receive his own reward according to his own labour.<br><br>For we are labourers together with God: ye are God's husbandry, ye are God's building.",
                "NASB": "What then is Apollos? And what is Paul? Servants through whom you believed, even as the Lord gave opportunity to each one. I planted, Apollos watered, but God was causing the growth. So then neither the one who plants nor the one who waters is anything, but God who causes the growth. Now the one who plants and the one who waters are one; but each will receive his own reward according to his own labor. For we are God’s fellow workers; you are God’s field, God’s building.",
                "NIV": "What, after all, is Apollos? And what is Paul? Only servants, through whom you came to believe—as the Lord has assigned to each his task. I planted the seed, Apollos watered it, but God has been making it grow. So neither the one who plants nor the one who waters is anything, but only God, who makes things grow. The one who plants and the one who waters have one purpose, and they will each be rewarded according to their own labor. For we are co-workers in God’s service; you are God’s field, God’s building.",
                "NKJV": "Who then is Paul, and who is Apollos, but ministers through whom you believed, as the Lord gave to each one? I planted, Apollos watered, but God gave the increase. So then neither he who plants is anything, nor he who waters, but God who gives the increase. Now he who plants and he who waters are one, and each one will receive his own reward according to his own labor.<br><br>For we are God’s fellow workers; you are God’s field, you are God’s building."
            },
            {
                "reference": "1 Corinthians 6:7",
                "ESV": "To have lawsuits at all with one another is already a defeat for you. Why not rather suffer wrong? Why not rather be defrauded?",
                "KJV": "Now therefore there is utterly a fault among you, because ye go to law one with another. Why do ye not rather take wrong? why do ye not rather suffer yourselves to be defrauded?",
                "NASB": "Actually, then, it is already a defeat for you, that you have lawsuits with one another. Why not rather suffer the wrong? Why not rather be defrauded?",
                "NIV": "The very fact that you have lawsuits among you means you have been completely defeated already. Why not rather be wronged? Why not rather be cheated?",
                "NKJV": "Now therefore, it is already an utter failure for you that you go to law against one another. Why do you not rather accept wrong? Why do you not rather let yourselves be cheated?"
            },
            {
                "reference": "1 Corinthians 9:19-22",
                "ESV": "For though I am free from all, I have made myself a servant to all, that I might win more of them. To the Jews I became as a Jew, in order to win Jews. To those under the law I became as one under the law (though not being myself under the law) that I might win those under the law. To those outside the law I became as one outside the law (not being outside the law of God but under the law of Christ) that I might win those outside the law. To the weak I became weak, that I might win the weak. I have become all things to all people, that by all means I might save some.",
                "KJV": "For though I be free from all men, yet have I made myself servant unto all, that I might gain the more.<br><br>And unto the Jews I became as a Jew, that I might gain the Jews; to them that are under the law, as under the law, that I might gain them that are under the law;<br><br>To them that are without law, as without law, (being not without law to God, but under the law to Christ,) that I might gain them that are without law.<br><br>To the weak became I as weak, that I might gain the weak: I am made all things to all men, that I might by all means save some.",
                "NASB": "For though I am free from all people, I have made myself a slave to all, so that I may gain more. To the Jews I became as a Jew, so that I might gain Jews; to those who are under the Law, I became as one under the Law, though not being under the Law myself, so that I might gain those who are under the Law; to those who are without the Law, I became as one without the Law, though not being without the law of God but under the law of Christ, so that I might gain those who are without the Law. To the weak I became weak, that I might gain the weak; I have become all things to all people, so that I may by all means save some.",
                "NIV": "Though I am free and belong to no one, I have made myself a slave to everyone, to win as many as possible. To the Jews I became like a Jew, to win the Jews. To those under the law I became like one under the law (though I myself am not under the law), so as to win those under the law. To those not having the law I became like one not having the law (though I am not free from God’s law but am under Christ’s law), so as to win those not having the law. To the weak I became weak, to win the weak. I have become all things to all people so that by all possible means I might save some.",
                "NKJV": "For though I am free from all men, I have made myself a servant to all, that I might win the more; and to the Jews I became as a Jew, that I might win Jews; to those who are under the law, as under the law, that I might win those who are under the law; to those who are without law, as without law (not being without law toward God, but under law toward Christ), that I might win those who are without law; to the weak I became as weak, that I might win the weak. I have become all things to all men, that I might by all means save some."
            },
            {
                "reference": "1 Corinthians 10:13",
                "ESV": "No temptation has overtaken you that is not common to man. God is faithful, and he will not let you be tempted beyond your ability, but with the temptation he will also provide the way of escape, that you may be able to endure it.",
                "KJV": "There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it.",
                "NASB": "No temptation has overtaken you except something common to mankind; and God is faithful, so He will not allow you to be tempted beyond what you are able, but with the temptation will provide the way of escape also, so that you will be able to endure it.",
                "NIV": "No temptation has overtaken you except what is common to mankind. And God is faithful; he will not let you be tempted beyond what you can bear. But when you are tempted, he will also provide a way out so that you can endure it.",
                "NKJV": "No temptation has overtaken you except such as is common to man; but God is faithful, who will not allow you to be tempted beyond what you are able, but with the temptation will also make the way of escape, that you may be able to bear it."
            },
            {
                "reference": "1 Corinthians 10:31",
                "ESV": "So, whether you eat or drink, or whatever you do, do all to the glory of God.",
                "KJV": "Whether therefore ye eat, or drink, or whatsoever ye do, do all to the glory of God.",
                "NASB": "Therefore, whether you eat or drink, or whatever you do, do all things for the glory of God.",
                "NIV": "So whether you eat or drink or whatever you do, do it all for the glory of God.",
                "NKJV": "Therefore, whether you eat or drink, or whatever you do, do all to the glory of God."
            },
            {
                "reference": "1 Corinthians 11:1",
                "ESV": "Be imitators of me, as I am of Christ.",
                "KJV": "Be ye followers of me, even as I also am of Christ.",
                "NASB": "Be imitators of me, just as I also am of Christ.",
                "NIV": "Follow my example, as I follow the example of Christ.",
                "NKJV": "Imitate me, just as I also imitate Christ."
            },
            {
                "reference": "1 Corinthians 11:23-26",
                "ESV": "For I received from the Lord what I also delivered to you, that the Lord Jesus on the night when he was betrayed took bread, and when he had given thanks, he broke it, and said, “This is my body, which is for you. Do this in remembrance of me.” In the same way also he took the cup, after supper, saying, “This cup is the new covenant in my blood. Do this, as often as you drink it, in remembrance of me.” For as often as you eat this bread and drink the cup, you proclaim the Lord's death until he comes.",
                "KJV": "For I have received of the Lord that which also I delivered unto you, that the Lord Jesus the same night in which he was betrayed took bread:<br><br>And when he had given thanks, he brake it, and said, Take, eat: this is my body, which is broken for you: this do in remembrance of me.<br><br>After the same manner also he took the cup, when he had supped, saying, this cup is the new testament in my blood: this do ye, as oft as ye drink it, in remembrance of me.<br><br>For as often as ye eat this bread, and drink this cup, ye do shew the Lord's death till he come.",
                "NASB": "For I received from the Lord that which I also delivered to you, that the Lord Jesus, on the night when He was betrayed, took bread; and when He had given thanks, He broke it and said, “This is My body, which is for you; do this in remembrance of Me.” In the same way He also took the cup after supper, saying, “This cup is the new covenant in My blood; do this, as often as you drink it, in remembrance of Me.” For as often as you eat this bread and drink the cup, you proclaim the Lord’s death until He comes.",
                "NIV": "For I received from the Lord what I also passed on to you: The Lord Jesus, on the night he was betrayed, took bread, and when he had given thanks, he broke it and said, “This is my body, which is for you; do this in remembrance of me.” In the same way, after supper he took the cup, saying, “This cup is the new covenant in my blood; do this, whenever you drink it, in remembrance of me.” For whenever you eat this bread and drink this cup, you proclaim the Lord’s death until he comes.",
                "NKJV": "For I received from the Lord that which I also delivered to you: that the Lord Jesus on the same night in which He was betrayed took bread; and when He had given thanks, He broke it and said, “Take, eat; this is My body which is broken for you; do this in remembrance of Me.” In the same manner He also took the cup after supper, saying, “This cup is the new covenant in My blood. This do, as often as you drink it, in remembrance of Me.”<br><br>For as often as you eat this bread and drink this cup, you proclaim the Lord’s death till He comes."
            },
            {
                "reference": "1 Corinthians 13:1-8",
                "ESV": "If I speak in the tongues of men and of angels, but have not love, I am a noisy gong or a clanging cymbal. And if I have prophetic powers, and understand all mysteries and all knowledge, and if I have all faith, so as to remove mountains, but have not love, I am nothing. If I give away all I have, and if I deliver up my body to be burned, but have not love, I gain nothing.<br><br>Love is patient and kind; love does not envy or boast; it is not arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice at wrongdoing, but rejoices with the truth. Love bears all things, believes all things, hopes all things, endures all things.<br><br>Love never ends. As for prophecies, they will pass away; as for tongues, they will cease; as for knowledge, it will pass away.",
                "KJV": "Though I speak with the tongues of men and of angels, and have not charity, I am become as sounding brass, or a tinkling cymbal.<br><br>And though I have the gift of prophecy, and understand all mysteries, and all knowledge; and though I have all faith, so that I could remove mountains, and have not charity, I am nothing.<br><br>And though I bestow all my goods to feed the poor, and though I give my body to be burned, and have not charity, it profiteth me nothing.<br><br>Charity suffereth long, and is kind; charity envieth not; charity vaunteth not itself, is not puffed up,<br><br>Doth not behave itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil;<br><br>Rejoiceth not in iniquity, but rejoiceth in the truth;<br><br>Beareth all things, believeth all things, hopeth all things, endureth all things.<br><br>Charity never faileth: but whether there be prophecies, they shall fail; whether there be tongues, they shall cease; whether there be knowledge, it shall vanish away.",
                "NASB": "If I speak with the tongues of mankind and of angels, but do not have love, I have become a noisy gong or a clanging cymbal. If I have the gift of prophecy and know all mysteries and all knowledge, and if I have all faith so as to remove mountains, but do not have love, I am nothing. And if I give away all my possessions to charity, and if I surrender my body so that I may glory, but do not have love, it does me no good.<br><br>Love is patient, love is kind, it is not jealous; love does not brag, it is not arrogant. It does not act disgracefully, it does not seek its own benefit; it is not provoked, does not keep an account of a wrong suffered, it does not rejoice in unrighteousness, but rejoices with the truth; it keeps every confidence, it believes all things, hopes all things, endures all things.<br><br>Love never fails; but if there are gifts of prophecy, they will be done away with; if there are tongues, they will cease; if there is knowledge, it will be done away with.",
                "NIV": "If I speak in the tongues of men or of angels, but do not have love, I am only a resounding gong or a clanging cymbal. If I have the gift of prophecy and can fathom all mysteries and all knowledge, and if I have a faith that can move mountains, but do not have love, I am nothing. If I give all I possess to the poor and give over my body to hardship that I may boast, but do not have love, I gain nothing.<br><br>Love is patient, love is kind. It does not envy, it does not boast, it is not proud. It does not dishonor others, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Love does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres.<br><br>Love never fails. But where there are prophecies, they will cease; where there are tongues, they will be stilled; where there is knowledge, it will pass away.",
                "NKJV": "Though I speak with the tongues of men and of angels, but have not love, I have become sounding brass or a clanging cymbal. And though I have the gift of prophecy, and understand all mysteries and all knowledge, and though I have all faith, so that I could remove mountains, but have not love, I am nothing. And though I bestow all my goods to feed the poor, and though I give my body to be burned, but have not love, it profits me nothing.<br><br>Love suffers long and is kind; love does not envy; love does not parade itself, is not puffed up; does not behave rudely, does not seek its own, is not provoked, thinks no evil; does not rejoice in iniquity, but rejoices in the truth; bears all things, believes all things, hopes all things, endures all things.<br><br>Love never fails. But whether there are prophecies, they will fail; whether there are tongues, they will cease; whether there is knowledge, it will vanish away."
            }
        ],
        "2 Corinthians": [
            {
                "reference": "2 Corinthians 4:16-18",
                "ESV": "So we do not lose heart. Though our outer self is wasting away, our inner self is being renewed day by day. For this light momentary affliction is preparing for us an eternal weight of glory beyond all comparison, as we look not to the things that are seen but to the things that are unseen. For the things that are seen are transient, but the things that are unseen are eternal.",
                "KJV": "For which cause we faint not; but though our outward man perish, yet the inward man is renewed day by day.<br><br>For our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory;<br><br>While we look not at the things which are seen, but at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal.",
                "NASB": "Therefore we do not lose heart, but though our outer person is decaying, yet our inner person is being renewed day by day. For our momentary, light affliction is producing for us an eternal weight of glory far beyond all comparison, while we look not at the things which are seen, but at the things which are not seen; for the things which are seen are temporal, but the things which are not seen are eternal.",
                "NIV": "Therefore we do not lose heart. Though outwardly we are wasting away, yet inwardly we are being renewed day by day. For our light and momentary troubles are achieving for us an eternal glory that far outweighs them all. So we fix our eyes not on what is seen, but on what is unseen, since what is seen is temporary, but what is unseen is eternal.",
                "NKJV": "Therefore we do not lose heart. Even though our outward man is perishing, yet the inward man is being renewed day by day. For our light affliction, which is but for a moment, is working for us a far more exceeding and eternal weight of glory, while we do not look at the things which are seen, but at the things which are not seen. For the things which are seen are temporary, but the things which are not seen are eternal."
            },
            {
                "reference": "2 Corinthians 5:17",
                "ESV": "Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.",
                "KJV": "Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.",
                "NASB": "Therefore if anyone is in Christ, this person is a new creation; the old things passed away; behold, new things have come.",
                "NIV": "Therefore, if anyone is in Christ, the new creation has come: The old has gone, the new is here!",
                "NKJV": "Therefore, if anyone is in Christ, he is a new creation; old things have passed away; behold, all things have become new."
            },
            {
                "reference": "2 Corinthians 6:14",
                "ESV": "Do not be unequally yoked with unbelievers. For what partnership has righteousness with lawlessness? Or what fellowship has light with darkness?",
                "KJV": "Be ye not unequally yoked together with unbelievers: for what fellowship hath righteousness with unrighteousness? and what communion hath light with darkness?",
                "NASB": "Do not be mismatched with unbelievers; for what do righteousness and lawlessness share together, or what does light have in common with darkness?",
                "NIV": "Do not be yoked together with unbelievers. For what do righteousness and wickedness have in common? Or what fellowship can light have with darkness?",
                "NKJV": "Do not be unequally yoked together with unbelievers. For what fellowship has righteousness with lawlessness? And what communion has light with darkness?"
            },
            {
                "reference": "2 Corinthians 12:9",
                "ESV": "But he said to me, “My grace is sufficient for you, for my power is made perfect in weakness.” Therefore I will boast all the more gladly of my weaknesses, so that the power of Christ may rest upon me.",
                "KJV": "And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me.",
                "NASB": "And He has said to me, “My grace is sufficient for you, for power is perfected in weakness.” Most gladly, therefore, I will rather boast about my weaknesses, so that the power of Christ may dwell in me.",
                "NIV": "But he said to me, “My grace is sufficient for you, for my power is made perfect in weakness.” Therefore I will boast all the more gladly about my weaknesses, so that Christ’s power may rest on me.",
                "NKJV": "And He said to me, “My grace is sufficient for you, for My strength is made perfect in weakness.” Therefore most gladly I will rather boast in my infirmities, that the power of Christ may rest upon me."
            }
        ],
        "Galatians": [
            {
                "reference": "Galatians 1:10",
                "ESV": "For am I now seeking the approval of man, or of God? Or am I trying to please man? If I were still trying to please man, I would not be a servant of Christ.",
                "KJV": "For do I now persuade men, or God? or do I seek to please men? for if I yet pleased men, I should not be the servant of Christ.",
                "NASB": "For am I now seeking the favor of people, or of God? Or am I striving to please people? If I were still trying to please people, I would not be a bond-servant of Christ.",
                "NIV": "Am I now trying to win the approval of human beings, or of God? Or am I trying to please people? If I were still trying to please people, I would not be a servant of Christ.",
                "NKJV": "For do I now persuade men, or God? Or do I seek to please men? For if I still pleased men, I would not be a bondservant of Christ."
            },
            {
                "reference": "Galatians 2:20",
                "ESV": "I have been crucified with Christ. It is no longer I who live, but Christ who lives in me. And the life I now live in the flesh I live by faith in the Son of God, who loved me and gave himself for me.",
                "KJV": "I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me.",
                "NASB": "I have been crucified with Christ; and it is no longer I who live, but Christ lives in me; and the life which I now live in the flesh I live by faith in the Son of God, who loved me and gave Himself up for me.",
                "NIV": "I have been crucified with Christ and I no longer live, but Christ lives in me. The life I now live in the body, I live by faith in the Son of God, who loved me and gave himself for me.",
                "NKJV": "I have been crucified with Christ; it is no longer I who live, but Christ lives in me; and the life which I now live in the flesh I live by faith in the Son of God, who loved me and gave Himself for me."
            },
            {
                "reference": "Galatians 3:28",
                "ESV": "There is neither Jew nor Greek, there is neither slave nor free, there is no male and female, for you are all one in Christ Jesus.",
                "KJV": "There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus.",
                "NASB": "There is neither Jew nor Greek, there is neither slave nor free, there is neither male nor female; for you are all one in Christ Jesus.",
                "NIV": "There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus.",
                "NKJV": "There is neither Jew nor Greek, there is neither slave nor free, there is neither male nor female; for you are all one in Christ Jesus."
            },
            {
                "reference": "Galatians 5:22-23",
                "ESV": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "KJV": "But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith,<br><br>Meekness, temperance: against such there is no law.",
                "NASB": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.",
                "NIV": "But the fruit of the Spirit is love, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness and self-control. Against such things there is no law.",
                "NKJV": "But the fruit of the Spirit is love, joy, peace, longsuffering, kindness, goodness, faithfulness, gentleness, self-control. Against such there is no law."
            }
        ],
        "Ephesians": [
            {
                "reference": "Ephesians 1:3-14",
                "ESV": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly places, even as he chose us in him before the foundation of the world, that we should be holy and blameless before him. In love he predestined us for adoption to himself as sons through Jesus Christ, according to the purpose of his will, to the praise of his glorious grace, with which he has blessed us in the Beloved. In him we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace, which he lavished upon us, in all wisdom and insight making known to us the mystery of his will, according to his purpose, which he set forth in Christ as a plan for the fullness of time, to unite all things in him, things in heaven and things on earth.<br><br>In him we have obtained an inheritance, having been predestined according to the purpose of him who works all things according to the counsel of his will, so that we who were the first to hope in Christ might be to the praise of his glory. In him you also, when you heard the word of truth, the gospel of your salvation, and believed in him, were sealed with the promised Holy Spirit, who is the guarantee of our inheritance until we acquire possession of it, to the praise of his glory.",
                "KJV": "Blessed be the God and Father of our Lord Jesus Christ, who hath blessed us with all spiritual blessings in heavenly places in Christ:<br><br>According as he hath chosen us in him before the foundation of the world, that we should be holy and without blame before him in love:<br><br>Having predestinated us unto the adoption of children by Jesus Christ to himself, according to the good pleasure of his will,<br><br>To the praise of the glory of his grace, wherein he hath made us accepted in the beloved.<br><br>In whom we have redemption through his blood, the forgiveness of sins, according to the riches of his grace;<br><br>Wherein he hath abounded toward us in all wisdom and prudence;<br><br>Having made known unto us the mystery of his will, according to his good pleasure which he hath purposed in himself:<br><br>That in the dispensation of the fulness of times he might gather together in one all things in Christ, both which are in heaven, and which are on earth; even in him:<br><br>In whom also we have obtained an inheritance, being predestinated according to the purpose of him who worketh all things after the counsel of his own will:<br><br>That we should be to the praise of his glory, who first trusted in Christ.<br><br>In whom ye also trusted, after that ye heard the word of truth, the gospel of your salvation: in whom also after that ye believed, ye were sealed with that holy Spirit of promise,<br><br>Which is the earnest of our inheritance until the redemption of the purchased possession, unto the praise of his glory.",
                "NASB": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavenly places in Christ, just as He chose us in Him before the foundation of the world, that we would be holy and blameless before Him. In love He predestined us to adoption as sons and daughters through Jesus Christ to Himself, according to the good pleasure of His will, to the praise of the glory of His grace, with which He favored us in the Beloved. In Him we have redemption through His blood, the forgiveness of our wrongdoings, according to the riches of His grace which He lavished on us. In all wisdom and insight He made known to us the mystery of His will, according to His good pleasure which He set forth in Him, regarding His plan of the fullness of the times, to bring all things together in Christ, things in the heavens and things on the earth. In Him we also have obtained an inheritance, having been predestined according to the purpose of Him who works all things in accordance with the plan of His will, to the end that we who were the first to hope in the Christ would be to the praise of His glory. In Him, you also, after listening to the message of truth, the gospel of your salvation—having also believed, you were sealed in Him with the Holy Spirit of the promise, who is a first installment of our inheritance, in regard to the redemption of God’s own possession, to the praise of His glory.",
                "NIV": "Praise be to the God and Father of our Lord Jesus Christ, who has blessed us in the heavenly realms with every spiritual blessing in Christ. For he chose us in him before the creation of the world to be holy and blameless in his sight. In love he predestined us for adoption to sonship through Jesus Christ, in accordance with his pleasure and will— to the praise of his glorious grace, which he has freely given us in the One he loves. In him we have redemption through his blood, the forgiveness of sins, in accordance with the riches of God’s grace that he lavished on us. With all wisdom and understanding, he made known to us the mystery of his will according to his good pleasure, which he purposed in Christ, to be put into effect when the times reach their fulfillment—to bring unity to all things in heaven and on earth under Christ.<br><br>In him we were also chosen, having been predestined according to the plan of him who works out everything in conformity with the purpose of his will, in order that we, who were the first to put our hope in Christ, might be for the praise of his glory. And you also were included in Christ when you heard the message of truth, the gospel of your salvation. When you believed, you were marked in him with a seal, the promised Holy Spirit, who is a deposit guaranteeing our inheritance until the redemption of those who are God’s possession—to the praise of his glory.",
                "NKJV": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavenly places in Christ, just as He chose us in Him before the foundation of the world, that we should be holy and without blame before Him in love, having predestined us to adoption as sons by Jesus Christ to Himself, according to the good pleasure of His will, to the praise of the glory of His grace, by which He made us accepted in the Beloved.<br><br>In Him we have redemption through His blood, the forgiveness of sins, according to the riches of His grace which He made to abound toward us in all wisdom and prudence, having made known to us the mystery of His will, according to His good pleasure which He purposed in Himself, that in the dispensation of the fullness of the times He might gather together in one all things in Christ, both which are in heaven and which are on earth—in Him. In Him also we have obtained an inheritance, being predestined according to the purpose of Him who works all things according to the counsel of His will, that we who first trusted in Christ should be to the praise of His glory.<br><br>In Him you also trusted, after you heard the word of truth, the gospel of your salvation; in whom also, having believed, you were sealed with the Holy Spirit of promise, who is the guarantee of our inheritance until the redemption of the purchased possession, to the praise of His glory."
            },
            {
                "reference": "Ephesians 2:8-9",
                "ESV": "For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast.",
                "KJV": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God:<br><br>Not of works, lest any man should boast.",
                "NASB": "For by grace you have been saved through faith; and this is not of yourselves, it is the gift of God; not a result of works, so that no one may boast.",
                "NIV": "For it is by grace you have been saved, through faith—and this is not from yourselves, it is the gift of God— not by works, so that no one can boast.",
                "NKJV": "For by grace you have been saved through faith, and that not of yourselves; it is the gift of God, not of works, lest anyone should boast."
            },
            {
                "reference": "Ephesians 3:14-21",
                "ESV": "For this reason I bow my knees before the Father, from whom every family in heaven and on earth is named, that according to the riches of his glory he may grant you to be strengthened with power through his Spirit in your inner being, so that Christ may dwell in your hearts through faith—that you, being rooted and grounded in love, may have strength to comprehend with all the saints what is the breadth and length and height and depth, and to know the love of Christ that surpasses knowledge, that you may be filled with all the fullness of God.<br><br>Now to him who is able to do far more abundantly than all that we ask or think, according to the power at work within us, to him be glory in the church and in Christ Jesus throughout all generations, forever and ever. Amen.",
                "KJV": "For this cause I bow my knees unto the Father of our Lord Jesus Christ,<br><br>Of whom the whole family in heaven and earth is named,<br><br>That he would grant you, according to the riches of his glory, to be strengthened with might by his Spirit in the inner man;<br><br>That Christ may dwell in your hearts by faith; that ye, being rooted and grounded in love,<br><br>May be able to comprehend with all saints what is the breadth, and length, and depth, and height;<br><br>And to know the love of Christ, which passeth knowledge, that ye might be filled with all the fulness of God.<br><br>Now unto him that is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us,<br><br>Unto him be glory in the church by Christ Jesus throughout all ages, world without end. Amen.",
                "NASB": "For this reason I bend my knees before the Father, from whom every family in heaven and on earth derives its name, that He would grant you, according to the riches of His glory, to be strengthened with power through His Spirit in the inner self, so that Christ may dwell in your hearts through faith; and that you, being rooted and grounded in love, may be able to comprehend with all the saints what is the width and length and height and depth, and to know the love of Christ which surpasses knowledge, that you may be filled to all the fullness of God.<br><br>Now to Him who is able to do far more abundantly beyond all that we ask or think, according to the power that works within us, to Him be the glory in the church and in Christ Jesus to all generations forever and ever. Amen.",
                "NIV": "For this reason I kneel before the Father, from whom every family in heaven and on earth derives its name. I pray that out of his glorious riches he may strengthen you with power through his Spirit in your inner being, so that Christ may dwell in your hearts through faith. And I pray that you, being rooted and established in love, may have power, together with all the Lord’s holy people, to grasp how wide and long and high and deep is the love of Christ, and to know this love that surpasses knowledge—that you may be filled to the measure of all the fullness of God.<br><br>Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us, to him be glory in the church and in Christ Jesus throughout all generations, for ever and ever! Amen.",
                "NKJV": "For this reason I bow my knees to the Father of our Lord Jesus Christ, from whom the whole family in heaven and earth is named, that He would grant you, according to the riches of His glory, to be strengthened with might through His Spirit in the inner man, that Christ may dwell in your hearts through faith; that you, being rooted and grounded in love, may be able to comprehend with all the saints what is the width and length and depth and height— to know the love of Christ which passes knowledge; that you may be filled with all the fullness of God.<br><br>Now to Him who is able to do exceedingly abundantly above all that we ask or think, according to the power that works in us, to Him be glory in the church by Christ Jesus to all generations, forever and ever. Amen."
            },
            {
                "reference": "Ephesians 4:29",
                "ESV": "Let no corrupting talk come out of your mouths, but only such as is good for building up, as fits the occasion, that it may give grace to those who hear.",
                "KJV": "Let no corrupt communication proceed out of your mouth, but that which is good to the use of edifying, that it may minister grace unto the hearers.",
                "NASB": "Let no unwholesome word come out of your mouth, but if there is any good word for edification according to the need of the moment, say that, so that it will give grace to those who hear.",
                "NIV": "Do not let any unwholesome talk come out of your mouths, but only what is helpful for building others up according to their needs, that it may benefit those who listen.",
                "NKJV": "Let no corrupt word proceed out of your mouth, but what is good for necessary edification, that it may impart grace to the hearers."
            }
        ],
        "Philippians": [
            {
                "reference": "Philippians 1:21",
                "ESV": "For to me to live is Christ, and to die is gain.",
                "KJV": "For to me to live is Christ, and to die is gain.",
                "NASB": "For to me, to live is Christ, and to die is gain.",
                "NIV": "For to me, to live is Christ and to die is gain.",
                "NKJV": "For to me, to live is Christ, and to die is gain."
            },
            {
                "reference": "Philippians 2:5-11",
                "ESV": "Have this mind among yourselves, which is yours in Christ Jesus, who, though he was in the form of God, did not count equality with God a thing to be grasped, but emptied himself, by taking the form of a servant, being born in the likeness of men. And being found in human form, he humbled himself by becoming obedient to the point of death, even death on a cross. Therefore God has highly exalted him and bestowed on him the name that is above every name, so that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, and every tongue confess that Jesus Christ is Lord, to the glory of God the Father.",
                "KJV": "Let this mind be in you, which was also in Christ Jesus:<br><br>Who, being in the form of God, thought it not robbery to be equal with God:<br><br>But made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men:<br><br>And being found in fashion as a man, he humbled himself, and became obedient unto death, even the death of the cross.<br><br>Wherefore God also hath highly exalted him, and given him a name which is above every name:<br><br>That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth;<br><br>And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father.",
                "NASB": "Have this attitude in yourselves which was also in Christ Jesus, who, as He already existed in the form of God, did not consider equality with God something to be grasped, but emptied Himself by taking the form of a bond-servant and being born in the likeness of men. And being found in appearance as a man, He humbled Himself by becoming obedient to the point of death: death on a cross. For this reason also God highly exalted Him, and bestowed on Him the name which is above every name, so that at the name of Jesus every knee will bow, of those who are in heaven and on earth and under the earth, and that every tongue will confess that Jesus Christ is Lord, to the glory of God the Father.",
                "NIV": "In your relationships with one another, have the same mindset as Christ Jesus:<br><br>Who, being in very nature God,<br>    did not consider equality with God something to be used to his own advantage;<br>rather, he made himself nothing<br>    by taking the very nature of a servant,<br>    being made in human likeness.<br>And being found in appearance as a man,<br>    he humbled himself<br>    by becoming obedient to death—<br>        even death on a cross!<br><br>Therefore God exalted him to the highest place<br>    and gave him the name that is above every name,<br>that at the name of Jesus every knee should bow,<br>    in heaven and on earth and under the earth,<br>and every tongue acknowledge that Jesus Christ is Lord,<br>    to the glory of God the Father.",
                "NKJV": "Let this mind be in you which was also in Christ Jesus, who, being in the form of God, did not consider it robbery to be equal with God, but made Himself of no reputation, taking the form of a bondservant, and coming in the likeness of men. And being found in appearance as a man, He humbled Himself and became obedient to the point of death, even the death of the cross. Therefore God also has highly exalted Him and given Him the name which is above every name, that at the name of Jesus every knee should bow, of those in heaven, and of those on earth, and of those under the earth, and that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father."
            },
            {
                "reference": "Philippians 3:7-11",
                "ESV": "But whatever gain I had, I counted as loss for the sake of Christ. Indeed, I count everything as loss because of the surpassing worth of knowing Christ Jesus my Lord. For his sake I have suffered the loss of all things and count them as rubbish, in order that I may gain Christ and be found in him, not having a righteousness of my own that comes from the law, but that which comes through faith in Christ, the righteousness from God that depends on faith— that I may know him and the power of his resurrection, and may share his sufferings, becoming like him in his death, that by any means possible I may attain the resurrection from the dead.",
                "KJV": "But what things were gain to me, those I counted loss for Christ.<br><br>Yea doubtless, and I count all things but loss for the excellency of the knowledge of Christ Jesus my Lord: for whom I have suffered the loss of all things, and do count them but dung, that I may win Christ,<br><br>And be found in him, not having mine own righteousness, which is of the law, but that which is through the faith of Christ, the righteousness which is of God by faith:<br><br>That I may know him, and the power of his resurrection, and the fellowship of his sufferings, being made conformable unto his death;<br><br>If by any means I might attain unto the resurrection of the dead.",
                "NASB": "But whatever things were gain to me, these things I have counted as loss because of Christ. More than that, I count all things to be loss in view of the surpassing value of knowing Christ Jesus my Lord, for whom I have suffered the loss of all things, and count them mere rubbish, so that I may gain Christ, and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith, that I may know Him and the power of His resurrection and the fellowship of His sufferings, being conformed to His death; if somehow I may attain to the resurrection from the dead.",
                "NIV": "But whatever were gains to me I now consider loss for the sake of Christ. What is more, I consider everything a loss because of the surpassing worth of knowing Christ Jesus my Lord, for whose sake I have lost all things. I consider them garbage, that I may gain Christ and be found in him, not having a righteousness of my own that comes from the law, but that which is through faith in Christ—the righteousness that comes from God on the basis of faith. I want to know Christ—yes, to know the power of his resurrection and participation in his sufferings, becoming like him in his death, and so, somehow, attaining to the resurrection from the dead.",
                "NKJV": "But what things were gain to me, these I have counted loss for Christ. Yet indeed I also count all things loss for the excellence of the knowledge of Christ Jesus my Lord, for whom I have suffered the loss of all things, and count them as rubbish, that I may gain Christ and be found in Him, not having my own righteousness, which is from the law, but that which is through faith in Christ, the righteousness which is from God by faith; that I may know Him and the power of His resurrection, and the fellowship of His sufferings, being conformed to His death, if, by any means, I may attain to the resurrection from the dead."
            },
            {
                "reference": "Philippians 3:14",
                "ESV": "I press on toward the goal for the prize of the upward call of God in Christ Jesus.",
                "KJV": "I press toward the mark for the prize of the high calling of God in Christ Jesus.",
                "NASB": "I press on toward the goal for the prize of the upward call of God in Christ Jesus.",
                "NIV": "I press on toward the goal to win the prize for which God has called me heavenward in Christ Jesus.",
                "NKJV": "I press toward the goal for the prize of the upward call of God in Christ Jesus."
            },
            {
                "reference": "Philippians 3:20",
                "ESV": "But our citizenship is in heaven, and from it we await a Savior, the Lord Jesus Christ,",
                "KJV": "For our conversation is in heaven; from whence also we look for the Saviour, the Lord Jesus Christ:",
                "NASB": "For our citizenship is in heaven, from which we also eagerly wait for a Savior, the Lord Jesus Christ;",
                "NIV": "But our citizenship is in heaven. And we eagerly await a Savior from there, the Lord Jesus Christ,",
                "NKJV": "For our citizenship is in heaven, from which we also eagerly wait for the Savior, the Lord Jesus Christ,"
            },
            {
                "reference": "Philippians 4:4",
                "ESV": "Rejoice in the Lord always; again I will say, rejoice.",
                "KJV": "Rejoice in the Lord always: and again I say, Rejoice.",
                "NASB": "Rejoice in the Lord always; again I will say, rejoice!",
                "NIV": "Rejoice in the Lord always. I will say it again: Rejoice!",
                "NKJV": "Rejoice in the Lord always. Again I will say, rejoice!"
            },
            {
                "reference": "Philippians 4:6-7",
                "ESV": "do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus.",
                "KJV": "Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God.<br><br>And the peace of God, which passeth all understanding, shall keep your hearts and minds through Christ Jesus.",
                "NASB": "Do not be anxious about anything, but in everything by prayer and pleading with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all comprehension, will guard your hearts and minds in Christ Jesus.",
                "NIV": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
                "NKJV": "Be anxious for nothing, but in everything by prayer and supplication, with thanksgiving, let your requests be made known to God; and the peace of God, which surpasses all understanding, will guard your hearts and minds through Christ Jesus."
            },
            {
                "reference": "Philippians 4:13",
                "ESV": "I can do all things through him who strengthens me.",
                "KJV": "I can do all things through Christ which strengtheneth me.",
                "NASB": "I can do all things through Him who strengthens me.",
                "NIV": "I can do all this through him who gives me strength.",
                "NKJV": "I can do all things through Christ who strengthens me."
            }
        ],
        "Colossians": [
            {
                "reference": "Colossians 1:15-20",
                "ESV": "He is the image of the invisible God, the firstborn of all creation. For by him all things were created, in heaven and on earth, visible and invisible, whether thrones or dominions or rulers or authorities—all things were created through him and for him. And he is before all things, and in him all things hold together. And he is the head of the body, the church. He is the beginning, the firstborn from the dead, that in everything he might be preeminent. For in him all the fullness of God was pleased to dwell, and through him to reconcile to himself all things, whether on earth or in heaven, making peace by the blood of his cross.",
                "KJV": "Who is the image of the invisible God, the firstborn of every creature:<br><br>For by him were all things created, that are in heaven, and that are in earth, visible and invisible, whether they be thrones, or dominions, or principalities, or powers: all things were created by him, and for him:<br><br>And he is before all things, and by him all things consist.<br><br>And he is the head of the body, the church: who is the beginning, the firstborn from the dead; that in all things he might have the preeminence.<br><br>For it pleased the Father that in him should all fulness dwell;<br><br>And, having made peace through the blood of his cross, by him to reconcile all things unto himself; by him, I say, whether they be things in earth, or things in heaven.",
                "NASB": "He is the image of the invisible God, the firstborn of all creation: for by Him all things were created, both in the heavens and on earth, visible and invisible, whether thrones, or dominions, or rulers, or authorities—all things have been created through Him and for Him. He is before all things, and in Him all things hold together. He is also the head of the body, the church; and He is the beginning, the firstborn from the dead, so that He Himself will come to have first place in everything. For it was the Father’s good pleasure for all the fullness to dwell in Him, and through Him to reconcile all things to Himself, whether things on earth or things in heaven, having made peace through the blood of His cross.",
                "NIV": "The Son is the image of the invisible God, the firstborn over all creation. For in him all things were created: things in heaven and on earth, visible and invisible, whether thrones or powers or rulers or authorities; all things have been created through him and for him. He is before all things, and in him all things hold together. And he is the head of the body, the church; he is the beginning and the firstborn from among the dead, so that in everything he might have the supremacy. For God was pleased to have all his fullness dwell in him, and through him to reconcile to himself all things, whether things on earth or things in heaven, by making peace through his blood, shed on the cross.",
                "NKJV": "He is the image of the invisible God, the firstborn over all creation. For by Him all things were created that are in heaven and that are on earth, visible and invisible, whether thrones or dominions or principalities or powers. All things were created through Him and for Him. And He is before all things, and in Him all things consist. And He is the head of the body, the church, who is the beginning, the firstborn from the dead, that in all things He may have the preeminence.<br><br>For it pleased the Father that in Him all the fullness should dwell, and by Him to reconcile all things to Himself, by Him, whether things on earth or things in heaven, having made peace through the blood of His cross."
            },
            {
                "reference": "Colossians 3:17",
                "ESV": "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him.",
                "KJV": "And whatsoever ye do in word or deed, do all in the name of the Lord Jesus, giving thanks to God and the Father by him.",
                "NASB": "Whatever you do in word or deed, do everything in the name of the Lord Jesus, giving thanks through Him to God the Father.",
                "NIV": "And whatever you do, whether in word or deed, do it all in the name of the Lord Jesus, giving thanks to God the Father through him.",
                "NKJV": "And whatever you do in word or deed, do all in the name of the Lord Jesus, giving thanks to God the Father through Him."
            },
            {
                "reference": "Colossians 3:23-24",
                "ESV": "Whatever you do, work heartily, as for the Lord and not for men, knowing that from the Lord you will receive the inheritance as your reward. You are serving the Lord Christ.",
                "KJV": "And whatsoever ye do, do it heartily, as to the Lord, and not unto men;<br><br>Knowing that of the Lord ye shall receive the reward of the inheritance: for ye serve the Lord Christ.",
                "NASB": "Whatever you do, do your work heartily, as for the Lord and not for people, knowing that it is from the Lord that you will receive the reward of the inheritance. It is the Lord Christ whom you serve.",
                "NIV": "Whatever you do, work at it with all your heart, as working for the Lord, not for human masters, since you know that you will receive an inheritance from the Lord as a reward. It is the Lord Christ you are serving.",
                "NKJV": "And whatever you do, do it heartily, as to the Lord and not to men, knowing that from the Lord you will receive the reward of the inheritance; for you serve the Lord Christ."
            }
        ],
        "1 Thessalonians": [
            {
                "reference": "1 Thessalonians 2:19-20",
                "ESV": "For what is our hope or joy or crown of boasting before our Lord Jesus at his coming? Is it not you? For you are our glory and joy.",
                "KJV": "For what is our hope, or joy, or crown of rejoicing? Are not even ye in the presence of our Lord Jesus Christ at his coming?<br><br>For ye are our glory and joy.",
                "NASB": "For who is our hope, or joy or crown of pride, in the presence of our Lord Jesus at His coming? Or is it not indeed you? For you are our glory and joy.",
                "NIV": "For what is our hope, our joy, or the crown in which we will glory in the presence of our Lord Jesus when he comes? Is it not you? Indeed, you are our glory and joy.",
                "NKJV": "For what is our hope, or joy, or crown of rejoicing? Is it not even you in the presence of our Lord Jesus Christ at His coming? For you are our glory and joy."
            },
            {
                "reference": "1 Thessalonians 5:16-18",
                "ESV": "Rejoice always, pray without ceasing, give thanks in all circumstances; for this is the will of God in Christ Jesus for you.",
                "KJV": "Rejoice evermore.<br><br>Pray without ceasing.<br><br>In every thing give thanks: for this is the will of God in Christ Jesus concerning you.",
                "NASB": "Rejoice always, pray without ceasing, in everything give thanks; for this is the will of God for you in Christ Jesus.",
                "NIV": "Rejoice always, pray continually, give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
                "NKJV": "Rejoice always, pray without ceasing, in everything give thanks; for this is the will of God in Christ Jesus for you."
            }
        ],
        "1 Timothy": [
            {
                "reference": "1 Timothy 1:15",
                "ESV": "The saying is trustworthy and deserving of full acceptance, that Christ Jesus came into the world to save sinners, of whom I am the foremost.",
                "KJV": "This is a faithful saying, and worthy of all acceptation, that Christ Jesus came into the world to save sinners; of whom I am chief.",
                "NASB": "It is a trustworthy statement, deserving full acceptance, that Christ Jesus came into the world to save sinners, among whom I am foremost.",
                "NIV": "Here is a trustworthy saying that deserves full acceptance: Christ Jesus came into the world to save sinners—of whom I am the worst.",
                "NKJV": "This is a faithful saying and worthy of all acceptance, that Christ Jesus came into the world to save sinners, of whom I am chief."
            },
            {
                "reference": "1 Timothy 1:17",
                "ESV": "To the King of the ages, immortal, invisible, the only God, be honor and glory forever and ever. Amen.",
                "KJV": "Now unto the King eternal, immortal, invisible, the only wise God, be honour and glory for ever and ever. Amen.",
                "NASB": "Now to the King eternal, immortal, invisible, the only God, be honor and glory forever and ever. Amen.",
                "NIV": "Now to the King eternal, immortal, invisible, the only God, be honor and glory for ever and ever. Amen.",
                "NKJV": "Now to the King eternal, immortal, invisible, to God who alone is wise, be honor and glory forever and ever. Amen."
            },
            {
                "reference": "1 Timothy 3:13",
                "ESV": "For those who serve well as deacons gain a good standing for themselves and also great confidence in the faith that is in Christ Jesus.",
                "KJV": "For they that have used the office of a deacon well purchase to themselves a good degree, and great boldness in the faith which is in Christ Jesus.",
                "NASB": "For those who have served well as deacons obtain for themselves a high standing and great confidence in the faith that is in Christ Jesus.",
                "NIV": "Those who have served well gain an excellent standing and great assurance in their faith in Christ Jesus.",
                "NKJV": "For those who have served well as deacons obtain for themselves a good standing and great boldness in the faith which is in Christ Jesus."
            }
        ],
        "2 Timothy": [
            {
                "reference": "2 Timothy 3:16-17",
                "ESV": "All Scripture is breathed out by God and profitable for teaching, for reproof, for correction, and for training in righteousness, that the man of God may be complete, equipped for every good work.",
                "KJV": "All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:<br><br>That the man of God may be perfect, thoroughly furnished unto all good works.",
                "NASB": "All Scripture is inspired by God and beneficial for teaching, for rebuke, for correction, for training in righteousness; so that the man or woman of God may be fully capable, equipped for every good work.",
                "NIV": "All Scripture is God-breathed and is useful for teaching, rebuking, correcting and training in righteousness, so that the servant of God may be thoroughly equipped for every good work.",
                "NKJV": "All Scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness, that the man of God may be complete, thoroughly equipped for every good work."
            },
            {
                "reference": "2 Timothy 4:7",
                "ESV": "I have fought the good fight, I have finished the race, I have kept the faith.",
                "KJV": "I have fought a good fight, I have finished my course, I have kept the faith:",
                "NASB": "I have fought the good fight, I have finished the course, I have kept the faith;",
                "NIV": "I have fought the good fight, I have finished the race, I have kept the faith.",
                "NKJV": "I have fought the good fight, I have finished the race, I have kept the faith."
            }
        ],
        "Hebrews": [
            {
                "reference": "Hebrews 4:12",
                "ESV": "For the word of God is living and active, sharper than any two-edged sword, piercing to the division of soul and of spirit, of joints and of marrow, and discerning the thoughts and intentions of the heart.",
                "KJV": "For the word of God is quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart.",
                "NASB": "For the word of God is living and active, and sharper than any two-edged sword, even penetrating as far as the division of soul and spirit, of both joints and marrow, and able to judge the thoughts and intentions of the heart.",
                "NIV": "For the word of God is alive and active. Sharper than any double-edged sword, it penetrates even to dividing soul and spirit, joints and marrow; it judges the thoughts and attitudes of the heart.",
                "NKJV": "For the word of God is living and powerful, and sharper than any two-edged sword, piercing even to the division of soul and spirit, and of joints and marrow, and is a discerner of the thoughts and intents of the heart."
            },
            {
                "reference": "Hebrews 4:14-16",
                "ESV": "Since then we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast our confession. For we do not have a high priest who is unable to sympathize with our weaknesses, but one who in every respect has been tempted as we are, yet without sin. Let us then with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need.",
                "KJV": "Seeing then that we have a great high priest, that is passed into the heavens, Jesus the Son of God, let us hold fast our profession.<br><br>For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin.<br><br>Let us therefore come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need.",
                "NASB": "Therefore, since we have a great high priest who has passed through the heavens, Jesus the Son of God, let’s hold firmly to our confession. For we do not have a high priest who cannot sympathize with our weaknesses, but One who has been tempted in all things just as we are, yet without sin. Therefore let’s approach the throne of grace with confidence, so that we may receive mercy and find grace for help at the time of our need.",
                "NIV": "Therefore, since we have a great high priest who has ascended into heaven, Jesus the Son of God, let us hold firmly to the faith we profess. For we do not have a high priest who is unable to empathize with our weaknesses, but we have one who has been tempted in every way, just as we are—yet he did not sin. Let us then approach God’s throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need.",
                "NKJV": "Seeing then that we have a great High Priest who has passed through the heavens, Jesus the Son of God, let us hold fast our confession. For we do not have a High Priest who cannot sympathize with our weaknesses, but was in all points tempted as we are, yet without sin. Let us therefore come boldly to the throne of grace, that we may obtain mercy and find grace to help in time of need."
            },
            {
                "reference": "Hebrews 10:24-25",
                "ESV": "And let us consider how to stir up one another to love and good works, not neglecting to meet together, as is the habit of some, but encouraging one another, and all the more as you see the Day drawing near.",
                "KJV": "And let us consider one another to provoke unto love and to good works:<br><br>Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching.",
                "NASB": "and let’s consider how to encourage one another in love and good deeds, not abandoning our own meeting together, as is the habit of some people, but encouraging one another; and all the more as you see the day drawing near.",
                "NIV": "And let us consider how we may spur one another on toward love and good deeds, not giving up meeting together, as some are in the habit of doing, but encouraging one another—and all the more as you see the Day approaching.",
                "NKJV": "And let us consider one another in order to stir up love and good works, not forsaking the assembling of ourselves together, as is the manner of some, but exhorting one another, and so much the more as you see the Day approaching."
            },
            {
                "reference": "Hebrews 11:1",
                "ESV": "Now faith is the assurance of things hoped for, the conviction of things not seen.",
                "KJV": "Now faith is the substance of things hoped for, the evidence of things not seen.",
                "NASB": "Now faith is the certainty of things hoped for, a proof of things not seen.",
                "NIV": "Now faith is confidence in what we hope for and assurance about what we do not see.",
                "NKJV": "Now faith is the substance of things hoped for, the evidence of things not seen."
            },
            {
                "reference": "Hebrews 12:1-2",
                "ESV": "Therefore, since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, looking to Jesus, the founder and perfecter of our faith, who for the joy that was set before him endured the cross, despising the shame, and is seated at the right hand of the throne of God.",
                "KJV": "Wherefore seeing we also are compassed about with so great a cloud of witnesses, let us lay aside every weight, and the sin which doth so easily beset us, and let us run with patience the race that is set before us,<br><br>Looking unto Jesus the author and finisher of our faith; who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God.",
                "NASB": "Therefore, since we also have such a great cloud of witnesses surrounding us, let’s rid ourselves of every obstacle and the sin which so easily entangles us, and let’s run with endurance the race that is set before us, looking only at Jesus, the originator and perfecter of the faith, who for the joy set before Him endured the cross, despising the shame, and has sat down at the right hand of the throne of God.",
                "NIV": "Therefore, since we are surrounded by such a great cloud of witnesses, let us throw off everything that hinders and the sin that so easily entangles. And let us run with perseverance the race marked out for us, fixing our eyes on Jesus, the pioneer and perfecter of faith. For the joy set before him he endured the cross, scorning its shame, and sat down at the right hand of the throne of God.",
                "NKJV": "Therefore we also, since we are surrounded by so great a cloud of witnesses, let us lay aside every weight, and the sin which so easily ensnares us, and let us run with endurance the race that is set before us, looking unto Jesus, the author and finisher of our faith, who for the joy that was set before Him endured the cross, despising the shame, and has sat down at the right hand of the throne of God."
            },
            {
                "reference": "Hebrews 13:7-8",
                "ESV": "Remember your leaders, those who spoke to you the word of God. Consider the outcome of their way of life, and imitate their faith. Jesus Christ is the same yesterday and today and forever.",
                "KJV": "Remember them which have the rule over you, who have spoken unto you the word of God: whose faith follow, considering the end of their conversation.<br><br>Jesus Christ the same yesterday, and to day, and for ever.",
                "NASB": "Remember those who led you, who spoke the word of God to you; and considering the result of their way of life, imitate their faith. Jesus Christ is the same yesterday and today, and forever.",
                "NIV": "Remember your leaders, who spoke the word of God to you. Consider the outcome of their way of life and imitate their faith. Jesus Christ is the same yesterday and today and forever.",
                "NKJV": "Remember those who rule over you, who have spoken the word of God to you, whose faith follow, considering the outcome of their conduct. Jesus Christ is the same yesterday, today, and forever."
            },
            {
                "reference": "Hebrews 13:20-21",
                "ESV": "Now may the God of peace who brought again from the dead our Lord Jesus, the great shepherd of the sheep, by the blood of the eternal covenant, equip you with everything good that you may do his will, working in us that which is pleasing in his sight, through Jesus Christ, to whom be glory forever and ever. Amen.",
                "KJV": "Now the God of peace, that brought again from the dead our Lord Jesus, that great shepherd of the sheep, through the blood of the everlasting covenant,<br><br>Make you perfect in every good work to do his will, working in you that which is wellpleasing in his sight, through Jesus Christ; to whom be glory for ever and ever. Amen.",
                "NASB": "Now may the God of peace, who brought up from the dead the great Shepherd of the sheep through the blood of the eternal covenant, that is, Jesus our Lord, equip you in every good thing to do His will, working in us that which is pleasing in His sight, through Jesus Christ, to whom be the glory forever and ever. Amen.",
                "NIV": "Now may the God of peace, who through the blood of the eternal covenant brought back from the dead our Lord Jesus, that great Shepherd of the sheep, equip you with everything good for doing his will, and may he work in us what is pleasing to him, through Jesus Christ, to whom be glory for ever and ever. Amen.",
                "NKJV": "Now may the God of peace who brought up our Lord Jesus from the dead, that great Shepherd of the sheep, through the blood of the everlasting covenant, make you complete in every good work to do His will, working in you what is well pleasing in His sight, through Jesus Christ, to whom be glory forever and ever. Amen."
            }
        ],
        "James": [
            {
                "reference": "James 1:5",
                "ESV": "If any of you lacks wisdom, let him ask God, who gives generously to all without reproach, and it will be given him.",
                "KJV": "If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.",
                "NASB": "But if any of you lacks wisdom, let him ask of God, who gives to all generously and without reproach, and it will be given to him.",
                "NIV": "If any of you lacks wisdom, you should ask God, who gives generously to all without finding fault, and it will be given to you.",
                "NKJV": "If any of you lacks wisdom, let him ask of God, who gives to all liberally and without reproach, and it will be given to him."
            },
            {
                "reference": "James 1:17",
                "ESV": "Every good gift and every perfect gift is from above, coming down from the Father of lights, with whom there is no variation or shadow due to change.",
                "KJV": "Every good gift and every perfect gift is from above, and cometh down from the Father of lights, with whom is no variableness, neither shadow of turning.",
                "NASB": "Every good thing given and every perfect gift is from above, coming down from the Father of lights, with whom there is no variation or shifting shadow.",
                "NIV": "Every good and perfect gift is from above, coming down from the Father of the heavenly lights, who does not change like shifting shadows.",
                "NKJV": "Every good gift and every perfect gift is from above, and comes down from the Father of lights, with whom there is no variation or shadow of turning."
            },
            {
                "reference": "James 2:17",
                "ESV": "So also faith by itself, if it does not have works, is dead.",
                "KJV": "Even so faith, if it hath not works, is dead, being alone.",
                "NASB": "In the same way, faith also, if it has no works, is dead, being by itself.",
                "NIV": "In the same way, faith by itself, if it is not accompanied by action, is dead.",
                "NKJV": "Thus also faith by itself, if it does not have works, is dead."
            },
            {
                "reference": "James 3:1",
                "ESV": "Not many of you should become teachers, my brothers, for you know that we who teach will be judged with greater strictness.",
                "KJV": "My brethren, be not many masters, knowing that we shall receive the greater condemnation.",
                "NASB": "Do not become teachers in large numbers, my brothers, since you know that we who are teachers will incur a stricter judgment.",
                "NIV": "Not many of you should become teachers, my fellow believers, because you know that we who teach will be judged more strictly.",
                "NKJV": "My brethren, let not many of you become teachers, knowing that we shall receive a stricter judgment."
            }
        ],
        "1 Peter": [
            {
                "reference": "1 Peter 1:8-9",
                "ESV": "Though you have not seen him, you love him. Though you do not now see him, you believe in him and rejoice with joy that is inexpressible and filled with glory, obtaining the outcome of your faith, the salvation of your souls.",
                "KJV": "Whom having not seen, ye love; in whom, though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory:<br><br>Receiving the end of your faith, even the salvation of your souls.",
                "NASB": "and though you have not seen Him, you love Him, and though you do not see Him now, but believe in Him, you greatly rejoice with joy inexpressible and full of glory, obtaining as the outcome of your faith, the salvation of your souls.",
                "NIV": "Though you have not seen him, you love him; and even though you do not see him now, you believe in him and are filled with an inexpressible and glorious joy, for you are receiving the end result of your faith, the salvation of your souls.",
                "NKJV": "whom having not seen you love. Though now you do not see Him, yet believing, you rejoice with joy inexpressible and full of glory, receiving the end of your faith—the salvation of your souls."
            },
            {
                "reference": "1 Peter 3:15",
                "ESV": "but in your hearts honor Christ the Lord as holy, always being prepared to make a defense to anyone who asks you for a reason for the hope that is in you; yet do it with gentleness and respect,",
                "KJV": "But sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear:",
                "NASB": "but sanctify Christ as Lord in your hearts, always being ready to make a defense to everyone who asks you to give an account for the hope that is in you, but with gentleness and respect;",
                "NIV": "But in your hearts revere Christ as Lord. Always be prepared to give an answer to everyone who asks you to give the reason for the hope that you have. But do this with gentleness and respect,",
                "NKJV": "But sanctify the Lord God in your hearts, and always be ready to give a defense to everyone who asks you a reason for the hope that is in you, with meekness and fear;"
            },
            {
                "reference": "1 Peter 4:10-11",
                "ESV": "As each has received a gift, use it to serve one another, as good stewards of God's varied grace: whoever speaks, as one who speaks oracles of God; whoever serves, as one who serves by the strength that God supplies—in order that in everything God may be glorified through Jesus Christ. To him belong glory and dominion forever and ever. Amen.",
                "KJV": "As every man hath received the gift, even so minister the same one to another, as good stewards of the manifold grace of God.<br><br>If any man speak, let him speak as the oracles of God; if any man minister, let him do it as of the ability which God giveth: that God in all things may be glorified through Jesus Christ, to whom be praise and dominion for ever and ever. Amen.",
                "NASB": "As each one has received a special gift, employ it in serving one another as good stewards of the multifaceted grace of God. Whoever speaks is to do so as one who is speaking actual words of God; whoever serves is to do so as one who is serving by the strength which God supplies; so that in all things God may be glorified through Jesus Christ, to whom belongs the glory and dominion forever and ever. Amen.",
                "NIV": "Each of you should use whatever gift you have received to serve others, as faithful stewards of God’s grace in its various forms. If anyone speaks, they should do so as one who speaks the very words of God. If anyone serves, they should do so with the strength God provides, so that in all things God may be praised through Jesus Christ. To him be the glory and the power for ever and ever. Amen.",
                "NKJV": "As each one has received a gift, minister it to one another, as good stewards of the manifold grace of God. If anyone speaks, let him speak as the oracles of God. If anyone ministers, let him do it as with the ability which God supplies, that in all things God may be glorified through Jesus Christ, to whom belong the glory and the dominion forever and ever. Amen."
            }
        ],
        "1 John": [
            {
                "reference": "1 John 1:5",
                "ESV": "This is the message we have heard from him and proclaim to you, that God is light, and in him is no darkness at all.",
                "KJV": "This then is the message which we have heard of him, and declare unto you, that God is light, and in him is no darkness at all.",
                "NASB": "This is the message we have heard from Him and announce to you, that God is Light, and in Him there is no darkness at all.",
                "NIV": "This is the message we have heard from him and declare to you: God is light; in him there is no darkness at all.",
                "NKJV": "This is the message which we have heard from Him and declare to you, that God is light and in Him is no darkness at all."
            },
            {
                "reference": "1 John 1:9",
                "ESV": "If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.",
                "KJV": "If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.",
                "NASB": "If we confess our sins, He is faithful and righteous, so that He will forgive us our sins and cleanse us from all unrighteousness.",
                "NIV": "If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.",
                "NKJV": "If we confess our sins, He is faithful and just to forgive us our sins and to cleanse us from all unrighteousness."
            },
            {
                "reference": "1 John 3:1",
                "ESV": "See what kind of love the Father has given to us, that we should be called children of God; and so we are. The reason why the world does not know us is that it did not know him.",
                "KJV": "Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God: therefore the world knoweth us not, because it knew him not.",
                "NASB": "See how great a love the Father has given us, that we would be called children of God; and in fact we are. For this reason the world does not know us: because it did not know Him.",
                "NIV": "See what great love the Father has lavished on us, that we should be called children of God! And that is what we are! The reason the world does not know us is that it did not know him.",
                "NKJV": "Behold what manner of love the Father has bestowed on us, that we should be called children of God! Therefore the world does not know us, because it did not know Him."
            },
            {
                "reference": "1 John 3:16",
                "ESV": "By this we know love, that he laid down his life for us, and we ought to lay down our lives for the brothers.",
                "KJV": "Hereby perceive we the love of God, because he laid down his life for us: and we ought to lay down our lives for the brethren.",
                "NASB": "We know love by this, that He laid down His life for us; and we ought to lay down our lives for the brothers and sisters.",
                "NIV": "This is how we know what love is: Jesus Christ laid down his life for us. And we ought to lay down our lives for our brothers and sisters.",
                "NKJV": "By this we know love, because He laid down His life for us. And we also ought to lay down our lives for the brethren."
            },
            {
                "reference": "1 John 4:7-10",
                "ESV": "Beloved, let us love one another, for love is from God, and whoever loves has been born of God and knows God. Anyone who does not love does not know God, because God is love. In this the love of God was made manifest among us, that God sent his only Son into the world, so that we might live through him. In this is love, not that we have loved God but that he loved us and sent his Son to be the propitiation for our sins.",
                "KJV": "Beloved, let us love one another: for love is of God; and every one that loveth is born of God, and knoweth God.<br><br>He that loveth not knoweth not God; for God is love.<br><br>In this was manifested the love of God toward us, because that God sent his only begotten Son into the world, that we might live through him.<br><br>Herein is love, not that we loved God, but that he loved us, and sent his Son to be the propitiation for our sins.",
                "NASB": "Beloved, let’s love one another; for love is from God, and everyone who loves has been born of God and knows God. The one who does not love does not know God, because God is love. By this the love of God was revealed in us, that God has sent His only Son into the world so that we may live through Him. In this is love, not that we loved God, but that He loved us and sent His Son to be the propitiation for our sins.",
                "NIV": "Dear friends, let us love one another, for love comes from God. Everyone who loves has been born of God and knows God. Whoever does not love does not know God, because God is love. This is how God showed his love among us: He sent his one and only Son into the world that we might live through him. This is love: not that we loved God, but that he loved us and sent his Son as an atoning sacrifice for our sins.",
                "NKJV": "Beloved, let us love one another, for love is of God; and everyone who loves is born of God and knows God. He who does not love does not know God, for God is love. In this the love of God was manifested toward us, that God has sent His only begotten Son into the world, that we might live through Him. In this is love, not that we loved God, but that He loved us and sent His Son to be the propitiation for our sins."
            }
        ],
        "Jude": [
            {
                "reference": "Jude 1:24-25",
                "ESV": "Now to him who is able to keep you from stumbling and to present you blameless before the presence of his glory with great joy, to the only God, our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority, before all time and now and forever. Amen.",
                "KJV": "Now unto him that is able to keep you from falling, and to present you faultless before the presence of his glory with exceeding joy,<br><br>To the only wise God our Saviour, be glory and majesty, dominion and power, both now and ever. Amen.",
                "NASB": "Now to Him who is able to protect you from stumbling, and to make you stand in the presence of His glory, blameless with great joy, to the only God our Savior, through Jesus Christ our Lord, be glory, majesty, dominion, and authority before all time and now and forever. Amen.",
                "NIV": "To him who is able to keep you from stumbling and to present you before his glorious presence without fault and with great joy— to the only God our Savior be glory, majesty, power and authority, through Jesus Christ our Lord, before all ages, now and forevermore! Amen.",
                "NKJV": "Now to Him who is able to keep you from stumbling,<br>And to present you faultless<br>Before the presence of His glory with exceeding joy,<br>To God our Savior,<br>Who alone is wise,<br>Be glory and majesty,<br>Dominion and power,<br>Both now and forever.<br>Amen."
            }
        ],
        "Revelation": [
            {
                "reference": "Revelation 21:4",
                "ESV": "He will wipe away every tear from their eyes, and death shall be no more, neither shall there be mourning, nor crying, nor pain anymore, for the former things have passed away.”",
                "KJV": "And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain: for the former things are passed away.",
                "NASB": "and He will wipe away every tear from their eyes; and there will no longer be any death; there will no longer be any mourning, or crying, or pain; the first things have passed away.”",
                "NIV": "‘He will wipe every tear from their eyes. There will be no more death’ or mourning or crying or pain, for the old order of things has passed away.”",
                "NKJV": "And God will wipe away every tear from their eyes; there shall be no more death, nor sorrow, nor crying. There shall be no more pain, for the former things have passed away.”"
            },
            {
                "reference": "Revelation 22:20-21",
                "ESV": "He who testifies to these things says, “Surely I am coming soon.” Amen. Come, Lord Jesus!<br><br>The grace of the Lord Jesus be with all. Amen.",
                "KJV": "He which testifieth these things saith, Surely I come quickly. Amen. Even so, come, Lord Jesus.<br><br>The grace of our Lord Jesus Christ be with you all. Amen.",
                "NASB": "He who testifies to these things says, “Yes, I am coming quickly.” Amen. Come, Lord Jesus.<br><br>The grace of the Lord Jesus be with all. Amen.",
                "NIV": "He who testifies to these things says, “Yes, I am coming soon.”<br><br>Amen. Come, Lord Jesus.<br><br>The grace of the Lord Jesus be with God’s people. Amen.",
                "NKJV": "He who testifies to these things says, “Surely I am coming quickly.”<br><br>Amen. Even so, come, Lord Jesus!<br><br>The grace of our Lord Jesus Christ be with you all. Amen."
            }
        ]
    }
}